#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AthenaChallengeRewardsMultiMarker

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaChallengeRewardsMultiMarker.AthenaChallengeRewardsMultiMarker_C.ExecuteUbergraph_AthenaChallengeRewardsMultiMarker
// 0x0020 (0x0020 - 0x0000)
struct AthenaChallengeRewardsMultiMarker_C_ExecuteUbergraph_AthenaChallengeRewardsMultiMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActive;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function AthenaChallengeRewardsMultiMarker.AthenaChallengeRewardsMultiMarker_C.BP_OnSetMarkerActive
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengeRewardsMultiMarker_C_BP_OnSetMarkerActive final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

