#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Assault_PastaRipper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Assault_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Assault_PastaRipper.B_Assault_PastaRipper_C
// 0x0040 (0x1400 - 0x13C0)
class AB_Assault_PastaRipper_C final : public AB_Assault_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Assault_PastaRipper_C;            // 0x13C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Is_Targeting;                                      // 0x13C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C9[0x7];                                     // 0x13C9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             TransformIntoADSAudio;                             // 0x13D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ADSColor;                                          // 0x13D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransformOutOfADSAudio;                            // 0x13E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hipfire_Color;                                     // 0x13F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Assault_PastaRipper(int32 EntryPoint);
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Assault_PastaRipper_C">();
	}
	static class AB_Assault_PastaRipper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Assault_PastaRipper_C>();
	}
};

}

