#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_FireExtinguisherWeapon

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Ranged_Generic_Athena_Deprecated_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_FireExtinguisherWeapon.B_FireExtinguisherWeapon_C
// 0x00B8 (0x13C0 - 0x1308)
class AB_FireExtinguisherWeapon_C final : public AB_Ranged_Generic_Athena_Deprecated_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_FireExtinguisherWeapon_C;         // 0x1308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABGA_FireExtinguisher_Pickup_C*         AttachedBGAActor;                                  // 0x1310(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocket;                                      // 0x1318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AttachedBGARelativeTransform;                      // 0x1320(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableAmmoMod;                                     // 0x1350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1351[0x7];                                     // 0x1351(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         IsShootableWhileHeld;                              // 0x1358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGuid                                  InventoryGUID;                                     // 0x1380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            WeaponReference;                                   // 0x1390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> InventoryInterface;                         // 0x1398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowHUDKeyActions;                                 // 0x13A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A9[0x3];                                     // 0x13A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                AttachedBGAScale;                                  // 0x13AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_FireExtinguisherWeapon(int32 EntryPoint);
	void OnUnholstered();
	void HUDKeyAction_Targeting(bool IsTargeting);
	void ReplicateOnUnholstered();
	void OnWeaponAttached();
	void UpdateAndAttachBGA();
	void ReplicateOnHolstered();
	void OnHolstered();
	void K2_OnUnEquip();
	void UnbindHolsterEvents();
	void BindHolsterEvents();
	void BGADestroyedWhileHeld();
	void ReceiveBeginPlay();
	void OnRep_AttachedBGAActor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FireExtinguisherWeapon_C">();
	}
	static class AB_FireExtinguisherWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FireExtinguisherWeapon_C>();
	}
};

}

