#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Grenade_Goop

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Grenade_Goop.B_Grenade_Goop_C.ExecuteUbergraph_B_Grenade_Goop
// 0x0008 (0x0008 - 0x0000)
struct B_Grenade_Goop_C_ExecuteUbergraph_B_Grenade_Goop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSetForLocalControllerOnly;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_Grenade_Goop.B_Grenade_Goop_C.OnWeaponVisibilityChanged
// 0x0002 (0x0002 - 0x0000)
struct B_Grenade_Goop_C_OnWeaponVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSetForLocalControllerOnly;                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

