#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_GravyGoblin_Athena

#include "Basic.hpp"

#include "GameplayMessages_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_GravyGoblin_Athena.B_GravyGoblin_Athena_C
// 0x0158 (0x1518 - 0x13C0)
class AB_GravyGoblin_Athena_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_GravyGoblin_Athena_C;             // 0x13C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGravityGunTargetTrackingComponent*     GravityGunTargetTracking;                          // 0x13C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GravyGoblin_MuzzleFlash;                        // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RingRight;                                         // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RingLeft;                                          // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GravyGoblin_Charge;                             // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GravyGoblin_Beam3;                              // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GravyGoblin_Beam2;                              // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GravyGoblin_Beam1;                              // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ring;                                              // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Reload_MagazineReload;                             // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Reload_Ammo;                                       // 0x1418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APrj_GravyGoblin_Holder_C*              Holder;                                            // 0x1420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowBeam;                                          // 0x1428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1429[0x7];                                     // 0x1429(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 TargetedActor;                                     // 0x1430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGravyGoblin_TargetBracketing_Widget_2_C* LockOnWidget_;                                   // 0x1438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         PossibleTargets;                                   // 0x1440(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          HasRing;                                           // 0x1450(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsHoldingObject;                                   // 0x1451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1452[0x6];                                     // 0x1452(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           UpdateTimer;                                       // 0x1458(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         HomingTargettingRange;                             // 0x1460(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FEventMessageTag                       Item_Activateable_Tag;                             // 0x1488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FEventMessageTag                       Item_Inactivateable_Tag;                           // 0x1490(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateBeamFX;                                      // 0x1498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1499[0x3];                                     // 0x1499(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                HolderLoc1;                                        // 0x149C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HolderLoc2;                                        // 0x14A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HolderLoc3;                                        // 0x14B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRotations;                                  // 0x14C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C4[0x4];                                     // 0x14C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         HomingTargettingRadius;                            // 0x14C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                TraceStart;                                        // 0x14F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceEnd;                                          // 0x14FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastDeactivatedTime;                               // 0x1508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ADSing_;                                           // 0x150C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_150D[0x3];                                     // 0x150D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         HomingTargetingRange;                              // 0x1510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_GravyGoblin_Athena(int32 EntryPoint);
	void BndEvt__GravityGunTargetTracking_K2Node_ComponentBoundEvent_3_DeactivateReticleDelegate__DelegateSignature();
	void BndEvt__GravityGunTargetTracking_K2Node_ComponentBoundEvent_2_FoundTargetDelegate__DelegateSignature(class AActor* NewTarget);
	void OnUnequip_Internal();
	void DeactivateReticle();
	void FoundTargettedActor(class AActor* TargetedActor_0);
	void OnWeaponAttached();
	void K2_OnUnEquip();
	void UpdateHomingTarget();
	void OnSpawnProjectile(class AFortProjectileBase* SpawnProjectile);
	void ReceiveBeginPlay();
	void HideRing();
	void ShowRing();
	void SetTargettedActor(TArray<struct FHitResult>& Array, bool SkipFillingActorArray);
	void SetHoldingState(bool IsHolding);
	void UpdateGunMode(bool IsEquipping);
	void ResetGunMode();
	void OnRep_HasRing();
	void RaycastResult(bool Succeeded, const class AActor* ActorHit, const struct FHitResult& HitResult);
	void FindTargettedActor_DEPRECATED();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_GravyGoblin_Athena_C">();
	}
	static class AB_GravyGoblin_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_GravyGoblin_Athena_C>();
	}
};

}

