#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_HeldObjectSocketManager

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HeldObjectSocketManager.B_HeldObjectSocketManager_C
// 0x0048 (0x08E0 - 0x0898)
class AB_HeldObjectSocketManager_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0898(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AB_HeldObjectSocket_C*>          HeldObjectSockets;                                 // 0x08A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	TArray<struct FGameplayTagContainer>          CurrentTags;                                       // 0x08B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTagContainer>          DefaultCorrectTags;                                // 0x08C8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          CombinationCorrect;                                // 0x08D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          SocketOrderMatters;                                // 0x08D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_HeldObjectSocketManager(int32 EntryPoint);
	void OnCombinationCorrect();
	void ReceiveBeginPlay();
	void UpdateHeldObjectTags(class AB_HeldObjectSocket_C* ChangedSocket);
	void VerifyHeldObjectTags(TArray<struct FGameplayTagContainer>& CorrectTags, TArray<struct FGameplayTagContainer>& CurrentTags_0, bool OrderMatters, bool* IsValidMatch);
	void CheckTagMatches();
	void OnRep_CombinationCorrect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HeldObjectSocketManager_C">();
	}
	static class AB_HeldObjectSocketManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HeldObjectSocketManager_C>();
	}
};

}

