#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Rifle_Sniper_ReactorGrade_Athena

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Rifle_Sniper_ReactorGrade_Athena.B_Rifle_Sniper_ReactorGrade_Athena_C
// 0x0080 (0x1440 - 0x13C0)
class AB_Rifle_Sniper_ReactorGrade_Athena_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Rifle_Sniper_ReactorGrade_Athena_C; // 0x13C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio_MinChargedReached;                           // 0x13C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponComponent_RecoilCurve*       FortWeaponComponent_RecoilCurve;                   // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponFxComponent_ChargeAimLocation* FortWeaponFxComponent_ChargeAimLocation;         // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Charging_Handle;                                   // 0x13E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_TraceThroughBuildingsLimit;                    // 0x13E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UForceFeedbackEffect*                   FF_Effect_Min_Charge_Reached;                      // 0x1410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                RefFFEvent;                                        // 0x1418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   FF_Effect_Min_To_Max_Charge;                       // 0x1420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_Chargeup_Weapon;                           // 0x1428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_Chargeup_Player;                           // 0x1430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           IsTargetingTag;                                    // 0x1438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Rifle_Sniper_ReactorGrade_Athena(int32 EntryPoint);
	void OnRemoteClientReachedMinCharge();
	void EndRecoil();
	void OnSetTargeting(bool bNewIsTargeting);
	void Start_Recoil();
	void Play_Charge_Montage();
	void OnReachedMinCharge();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void K2_OnUnEquip();
	void OnEndCharge();
	void Tick_Charge_Aim();
	void OnChargeUp();
	void ReceiveBeginPlay();
	void OnCompleted_7319C0D84136FBA734AF66BA1F9E9C6D(class FName NotifyName);
	void OnBlendOut_7319C0D84136FBA734AF66BA1F9E9C6D(class FName NotifyName);
	void OnInterrupted_7319C0D84136FBA734AF66BA1F9E9C6D(class FName NotifyName);
	void OnNotifyBegin_7319C0D84136FBA734AF66BA1F9E9C6D(class FName NotifyName);
	void OnNotifyEnd_7319C0D84136FBA734AF66BA1F9E9C6D(class FName NotifyName);
	void OnCompleted_73D1D33E4FEC2AE3F6340B9CEC25CD3A(class FName NotifyName);
	void OnBlendOut_73D1D33E4FEC2AE3F6340B9CEC25CD3A(class FName NotifyName);
	void OnInterrupted_73D1D33E4FEC2AE3F6340B9CEC25CD3A(class FName NotifyName);
	void OnNotifyBegin_73D1D33E4FEC2AE3F6340B9CEC25CD3A(class FName NotifyName);
	void OnNotifyEnd_73D1D33E4FEC2AE3F6340B9CEC25CD3A(class FName NotifyName);
	void UserConstructionScript();
	void GetDamageStartAndDirection(struct FVector* DamageStart, struct FVector* Direction);
	void UpdateAimOffset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Rifle_Sniper_ReactorGrade_Athena_C">();
	}
	static class AB_Rifle_Sniper_ReactorGrade_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Rifle_Sniper_ReactorGrade_Athena_C>();
	}
};

}

