#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePassLandingPages17

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePassS17UI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassLandingPages17.BattlePassLandingPages17_C
// 0x00B0 (0x0540 - 0x0490)
class UBattlePassLandingPages17_C final : public UBattlePassLandingPageS17
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_OwnBP;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USeasonalDataWidget_C*                  SeasonDataWidget;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_BottonButtons;                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_show_BP_character;                              // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Custo_Character;                           // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Mystery_Character;                         // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Bonus_Character;                           // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Crew_Character;                            // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Buy_BP;                                    // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Buy_Level;                                 // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Gift_Battle_Pass;                          // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          own_BP;                                            // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          is_time_locked;                                    // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BattlePassLandingPages17(int32 EntryPoint);
	void Set_Quest_Page_Delay(bool Is_locked);
	void OnBattlePassSubscriptionAllowed(const bool bSubscriptionAllowed);
	void OnBattlePassGiftingAllowed(const bool bGiftingAllowed);
	void On_Level_Changed(int32 Level);
	void OnEnterSubPage();
	void On_BattlePass_completed(bool BPComplete);
	void BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void OnBattlePassOwned();
	void Button_BuyBattlePass_Event_0(class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyBattlePass_0);
	void Button_GiftBattlePass_Event_0(class UBattlePassS17_LandingPage_SmallButton_C* Button_GiftBattlePass_0);
	void Button_BuyResources_Event_0(class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyResources_0);
	void Button_JoinSubscription_Event_0(class UBattlePassLandingPageButtonS17_C* Button_JoinSubscription_0);
	void Button_BonusRewards_Event_0(class UBattlePassLandingPageButtonS17_C* Button_BonusRewards_0);
	void Button_MysteryRewards_Event_0(class UBattlePassLandingPageButtonS17_C* Button_MysteryRewards);
	void Button_CharacterCustomizer_Event_0(class UBattlePassLandingPageButtonS17_C* Button_CharacterCustomizer_0);
	void Button_RewardOverview_Event_2(class UBattlePassLandingPageButtonS17_C* Button_RewardOverview);
	void Play_Intro();
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_0(class UBattlePassLandingPageButtonS17_C* Button_RewardOverview);
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_1(class UBattlePassLandingPageButtonS17_C* Button_CharacterCustomizer_0);
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_2(class UBattlePassLandingPageButtonS17_C* Button_MysteryRewards);
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_3(class UBattlePassLandingPageButtonS17_C* Button_BonusRewards_0);
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_4(class UBattlePassLandingPageButtonS17_C* Button_JoinSubscription_0);
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_5(class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyResources_0);
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_6(class UBattlePassS17_LandingPage_SmallButton_C* Button_GiftBattlePass_0);
	void SequenceEvent__ENTRYPOINTBattlePassLandingPages17_7(class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyBattlePass_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassLandingPages17_C">();
	}
	static class UBattlePassLandingPages17_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPages17_C>();
	}
};

}

