#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BGA_Pickup_Dummy_GravyGoblin

#include "Basic.hpp"

#include "BGA_Athena_Physics_Parent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Pickup_Dummy_GravyGoblin.BGA_Pickup_Dummy_GravyGoblin_C
// 0x0020 (0x08F0 - 0x08D0)
class ABGA_Pickup_Dummy_GravyGoblin_C final : public ABGA_Athena_Physics_Parent_C
{
public:
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Pickup_Dummy_GravyGoblin_C;     // 0x08D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Thrown;                                            // 0x08D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortWorldItemDefinition*               ItemDef;                                           // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            AttachedPickup;                                    // 0x08E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Pickup_Dummy_GravyGoblin(int32 EntryPoint);
	void Throw();
	void Detach(const struct FVector& NewLocation);
	void BndEvt__ParentMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnRep_Thrown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Pickup_Dummy_GravyGoblin_C">();
	}
	static class ABGA_Pickup_Dummy_GravyGoblin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Pickup_Dummy_GravyGoblin_C>();
	}
};

}

