#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BGA_Goop

#include "Basic.hpp"

#include "BGA_Alpaca_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Goop_Intersection_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Goop.BGA_Goop_C
// 0x01F0 (0x0B88 - 0x0998)
class ABGA_Goop_C : public ABGA_Alpaca_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Goop_C;                         // 0x0998(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortAudioShapeBoxComponent*            FortAudioShapeBox;                                 // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x09A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Biome_Volume_InWorld;                           // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         InsideSweep_Inside_8FCAC35C485793586ED950B6186BEA1B; // 0x09B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            InsideSweep__Direction_8FCAC35C485793586ED950B6186BEA1B; // 0x09BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BD[0x3];                                      // 0x09BD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     InsideSweep;                                       // 0x09C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_Size_X;                                        // 0x09C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Size_Y;                                        // 0x09F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Size_Z;                                        // 0x0A18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnOffset_Z;                                 // 0x0A40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FB_Goop_Intersection                   PawnIntersectWorldLocation;                        // 0x0A68(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Box_Extent;                                        // 0x0A80(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8C[0x4];                                      // 0x0A8C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x0A90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 Actor_Class_Filter;                                // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MinXYDistanceBetweenBiomes;                    // 0x0AA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MinZDistanceBetweenBiomes;                     // 0x0AD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsDying;                                           // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF9[0x3];                                      // 0x0AF9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DelayDeletingOverlappingGoopVolumes;               // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tags_Parachuting;                                  // 0x0B00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AAGV_Actor_Goop_C*                      AGVActor;                                          // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_PreventIntersectVFX;                           // 0x0B28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsDynamicTransform;                                // 0x0B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldTestForOtherBiomes;                         // 0x0B49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4A[0x6];                                      // 0x0B4A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UPrimitiveComponent*>            OverlappedStaticMeshComponents;                    // 0x0B50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FScalableFloat                         Row_bSelfDestructIfOverlappingVent;                // 0x0B60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BGA_Goop(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void BndEvt__FortAudioShapeBox_K2Node_ComponentBoundEvent_1_OnAudioShapeInsideStateChanged__DelegateSignature(bool bIsInside);
	void ReceiveBeginPlay();
	void ResetIntersectDoOnce();
	void PlayIntersectEffect(const struct FVector& Intersect_Position, bool ExitingVolume, class AFortPawn* Pawn);
	void InsideSweep__UpdateFunc();
	void InsideSweep__FinishedFunc();
	void UserConstructionScript();
	void ApplyPawnEffects(class AFortPawn* Pawn);
	void RemovePawnEffects(class AFortPawn* Pawn);
	void OnRep_PawnIntersectWorldLocation();
	struct FVector GetPawnIntersectLocation(class ACharacter* Target);
	void UpdateAudioShapeTransform(bool IsDynamicUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Goop_C">();
	}
	static class ABGA_Goop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Goop_C>();
	}
};

}

