#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Blueprint_Paper_VIM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// 0x0510 (0x0920 - 0x0410)
class UBlueprint_Paper_VIM_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_3;                        // 0x0418(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x0540(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x0668(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x0790(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08B8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x08D8(0x0030)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0908(0x0010)()

public:
	void ExecuteUbergraph_Blueprint_Paper_VIM(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blueprint_Paper_VIM_C">();
	}
	static class UBlueprint_Paper_VIM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprint_Paper_VIM_C>();
	}
};

}

