#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BodyguardRuntime

#include "Basic.hpp"

#include "BodyguardRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class BodyguardRuntime.BodyguardPlayerComponent
// 0x0090 (0x0140 - 0x00B0)
class UBodyguardPlayerComponent final : public UFortControllerComponent
{
public:
	uint8                                         Pad_B0[0x70];                                      // 0x00B0(0x0070)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsReviving;                                       // 0x0120(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBodyguardPlayerRole                          BodyguardRole;                                     // 0x0121(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_122[0xE];                                      // 0x0122(0x000E)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortAthenaMutator_Bodyguard*           ManagingMutator;                                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableSkinSwapping;                               // 0x0138(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ClientOnBodyguardIsTooFarFromVIP();
	void ClientOnLocalSquadVIPTookDamage();
	void ClientOnNotifyVIPTeammateIsDowned();
	void ClientOnTeamEliminated();
	void ClientOnVIPHasBeenReassigned(const class AFortPlayerStateAthena* NewVIPlayerState);
	void ClientPlayerEliminatedVIP();
	void OnEmoteMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void OnFortPCPawnChangedEvent(class AFortPawn* NewPawn);
	void OnPawnStartedEmote(class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting);
	void OnPlacementSet(class AFortPlayerStateAthena* Sender, int32 NewPlace);
	void OnPlayerRevived(const class AController* EventInstigator);
	void OnRep_BodyguardRole();
	void SetIsBodyguardTooFarFromVIP(const bool bValue);

	bool IsSkinSwappingEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BodyguardPlayerComponent">();
	}
	static class UBodyguardPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyguardPlayerComponent>();
	}
};

// Class BodyguardRuntime.BodyguardSoundActor
// 0x0028 (0x0248 - 0x0220)
class ABodyguardSoundActor final : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0228(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	void UpdateTeamVIPHealth_BP(const float CurrentHealth, const float MaxHealth, const bool bIsLocalPlayerTheVIP);
	void UpdateTeamVIPIsBeingRevived_BP(const bool bIsBeingRevived, const bool bIsTeamVIP_DBNO, const bool bIsReviving, const bool bIsLocalPlayerTheVIP);
	void UpdateTeamVIPIsDBNO_BP(const bool bIsTeamVIP_DBNO, const bool bIsLocalPlayerTheVIP, const bool bIsDead);

	void HandleVIPNotAllowItemPickup_BP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BodyguardSoundActor">();
	}
	static class ABodyguardSoundActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABodyguardSoundActor>();
	}
};

// Class BodyguardRuntime.FortAthenaMutator_Bodyguard
// 0x0520 (0x08F8 - 0x03D8)
class AFortAthenaMutator_Bodyguard : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_3D8[0x20];                                     // 0x03D8(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           VIPKillAccoladeTag;                                // 0x03F8(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VIPMultiKillAccoladeTag;                           // 0x0400(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BodyguardReviveAccoladeTag;                        // 0x0408(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VIPReviveAccoladeTag;                              // 0x0410(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VIPSurviveAccoladeTag;                             // 0x0418(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         VIPMultikillAccoladeThreshold;                     // 0x0420(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class ABodyguardSoundActor*                   BodyguardSoundPlayer;                              // 0x0448(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  VIPLostDeathReasonTagContainter;                   // 0x0450(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FItemAndCount>                  VIPItemList;                                       // 0x0470(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FItemAndCount>                  BodyguardItemList;                                 // 0x0480(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class UFortItemDefinition*, int32>       ItemToDesiredQuickBarSlotMap;                      // 0x0490(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  VIPProhibitedItemTags;                             // 0x04E0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BodyguardProhibitedItemTags;                       // 0x0500(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnZLocationOffset;                            // 0x0520(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   VIPBlockedItemText;                                // 0x0548(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            VIPMapIconBrush;                                   // 0x0560(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              MinimapPositionShiftPercent;                       // 0x05E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              MiniMapIconScale;                                  // 0x05F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 VIPCompassIconBackDrop;                            // 0x05F8(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 VIPCompassIcon;                                    // 0x0698(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             VIPBlockInteractClasses;                           // 0x0738(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VIPEliminatedEndGameScreenDelay;                   // 0x0748(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EAthenaGamePhase                              StartingVIPPlayerStateChangeTrackingGamePhase;     // 0x0770(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_771[0xF];                                      // 0x0771(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         UpdateIntervalMonitorVIPPlayerStateChanges;        // 0x0780(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HideDBNOVIPPlayerIndicators;                       // 0x07A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBodyGuardPartOverrideData>     PartOverrideCustomizations;                        // 0x07D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UCustomCharacterPart*>           PartsToSwapInToRemoveExtras;                       // 0x07E0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ShouldSwapSkins;                                   // 0x07F0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SkinMetaTagsToSkip;                                // 0x0818(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SpecialTags;                                       // 0x0838(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ExtraSpecialTags;                                  // 0x0858(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EnemyVIPsRemainingUIDelay;                         // 0x0878(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A0[0x8];                                      // 0x08A0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FBodyguardVIPPlayerData>        VIPPlayerDataList;                                 // 0x08A8(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBodyguardVIPDeathState>        VIPDeathStateList;                                 // 0x08B8(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FBodyguardVIPPlayerData                PreviousTeamVIPPlayerData;                         // 0x08C8(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortGameplayMutator>       MutatorClassToWaitFor;                             // 0x08E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortGameplayMutator*                   CustomCharacterPartsMutator;                       // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         RevealPlayerRole;                                  // 0x08F0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8F1[0x7];                                      // 0x08F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AssignPlayerRolesForSquads();
	void EndGameShutOffAnyDBNOSounds();
	void NotifySquadmatesOnVIPTookDamage(uint8 VIPTeam);
	void NotifyVIPOnTeammateDBNO(uint8 VIPTeam);
	void OnRep_RevealPlayerRole();
	void OnRep_VIPDeathStateList();
	void OnRep_VIPPlayerDataList();
	void ShutOffAnyDBNOSounds(const bool bIsDead);
	void UpdateSquadmatesIsReviving(uint8 VIPTeam);

	float GetEnemyVIPsRemainingUIDelay() const;
	bool GetTeamVIPPlayerData(const uint8 TeamNum, struct FBodyguardVIPPlayerData* OutVIPPlayerData) const;
	bool IsReviving(const class AFortPlayerStateAthena* PlayerState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Bodyguard">();
	}
	static class AFortAthenaMutator_Bodyguard* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Bodyguard>();
	}
};

// Class BodyguardRuntime.FortAthenaMutator_BodyguardRumble
// 0x0000 (0x08F8 - 0x08F8)
class AFortAthenaMutator_BodyguardRumble final : public AFortAthenaMutator_Bodyguard
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_BodyguardRumble">();
	}
	static class AFortAthenaMutator_BodyguardRumble* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_BodyguardRumble>();
	}
};

}

