#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BodyguardUI

#include "Basic.hpp"

#include "BodyguardRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BodyguardUI.BodyguardWidgetBase.HandleOnGamePhaseChanged_BP
// 0x0001 (0x0001 - 0x0000)
struct BodyguardWidgetBase_HandleOnGamePhaseChanged_BP final
{
public:
	EAthenaGamePhase                              NewPhase;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardWidgetBase.HandleOnTeamVIPReassignment_BP
// 0x0008 (0x0008 - 0x0000)
struct BodyguardWidgetBase_HandleOnTeamVIPReassignment_BP final
{
public:
	const class AFortPlayerStateAthena*           NewVIPPlayerState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardWidgetBase.HandlePlayerRoleChange_BP
// 0x0001 (0x0001 - 0x0000)
struct BodyguardWidgetBase_HandlePlayerRoleChange_BP final
{
public:
	EBodyguardPlayerRole                          NewPlayerRole;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardWidgetBase.OnMutatorAvailable
// 0x0008 (0x0008 - 0x0000)
struct BodyguardWidgetBase_OnMutatorAvailable final
{
public:
	class AFortGameplayMutator*                   MutatorActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardWidgetBase.UpdateEnemyVIPCount_BP
// 0x0001 (0x0001 - 0x0000)
struct BodyguardWidgetBase_UpdateEnemyVIPCount_BP final
{
public:
	uint8                                         EnemyVIPCount;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardWidgetBase.GetBodyguardMutator
// 0x0008 (0x0008 - 0x0000)
struct BodyguardWidgetBase_GetBodyguardMutator final
{
public:
	class AFortAthenaMutator_Bodyguard*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardWidgetBase.GetOwningPlayerRole
// 0x0001 (0x0001 - 0x0000)
struct BodyguardWidgetBase_GetOwningPlayerRole final
{
public:
	EBodyguardPlayerRole                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardWidgetBase.GetVIPPlayerStateForTeam
// 0x0010 (0x0010 - 0x0000)
struct BodyguardWidgetBase_GetVIPPlayerStateForTeam final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerState*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardPlayerInfoBase.IsViewingPlayerVIP
// 0x0001 (0x0001 - 0x0000)
struct BodyguardPlayerInfoBase_IsViewingPlayerVIP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardPlayerRoleRevealWidget.SetTeamVIPAvatarImage
// 0x0010 (0x0010 - 0x0000)
struct BodyguardPlayerRoleRevealWidget_SetTeamVIPAvatarImage final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortLazyImage*                         AvatarImageWidget;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BodyguardUI.BodyguardRumbleHUD.UpdatedVIPCount_BP
// 0x0002 (0x0002 - 0x0000)
struct BodyguardRumbleHUD_UpdatedVIPCount_BP final
{
public:
	uint8                                         EnemyVIPs;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         FriendlyVIPs;                                      // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

