#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Goop_ProjectileTrajectory_SnapToGrid

#include "Basic.hpp"

#include "BP_ProjectileTrajectory_Athena_SnapToGridArrow_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Goop_ProjectileTrajectory_SnapToGrid.BP_Goop_ProjectileTrajectory_SnapToGrid_C
// 0x01F0 (0x0550 - 0x0360)
class ABP_Goop_ProjectileTrajectory_SnapToGrid_C final : public ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Goop_ProjectileTrajectory_SnapToGrid_C; // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PreviewScale_Scalar_6287EBF9467FA31F97650A806BE1C480; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PreviewScale__Direction_6287EBF9467FA31F97650A806BE1C480; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     PreviewScale;                                      // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_Preview_SpawnOffset_Z;                         // 0x0378(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Preview_Size_X;                                // 0x03A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Preview_Size_Y;                                // 0x03C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Preview_Size_Z;                                // 0x03F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform_Preview;                                 // 0x0420(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Transform_Spawn;                                   // 0x0450(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FScalableFloat                         Row_Spawn_SpawnOffset_Z;                           // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Spawn_Size_X;                                  // 0x04A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Spawn_Size_Y;                                  // 0x04D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Spawn_Size_Z;                                  // 0x04F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_bUseScalingPreview;                            // 0x0520(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Goop_ProjectileTrajectory_SnapToGrid(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ScalePreview();
	void PreviewScale__UpdateFunc();
	void PreviewScale__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Goop_ProjectileTrajectory_SnapToGrid_C">();
	}
	static class ABP_Goop_ProjectileTrajectory_SnapToGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Goop_ProjectileTrajectory_SnapToGrid_C>();
	}
};

}

