#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SpecialEvent_Countdown_Timer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CountdownMaster_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpecialEvent_Countdown_Timer.BP_SpecialEvent_Countdown_Timer_C
// 0x0090 (0x03C8 - 0x0338)
class ABP_SpecialEvent_Countdown_Timer_C final : public ABP_CountdownMaster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SpecialEvent_Countdown_Timer_C;  // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Buffet_TimerMesh;                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_NewTrack_0_A80A3E1E4567FD0C6A33449632F8D8D6;  // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fade__Direction_A80A3E1E4567FD0C6A33449632F8D8D6;  // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Fade;                                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 VIsibleCalendarEventName;                          // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Stage;                                             // 0x0368(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         TwoMinuteMark;                                     // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugCountdownSpeed;                               // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseAlienNumberGlyphs;                              // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRandomStream                          RandomGlyphStream;                                 // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	bool                                          DebugCountdown;                                    // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimespan                              TimespanRemaining;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 Event_to_Watch;                                    // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 AlienGlyphEventName;                               // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsPlayingBuffet;                                   // 0x03B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAudioComponent*                        PreShowAudioComponent;                             // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFrontendMap_;                                    // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SpecialEvent_Countdown_Timer(int32 EntryPoint);
	void CreateLocalizedCountdownText();
	void UpdateTimerWithCalendarEvent();
	void FadeOutTimer();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Two_Minute_Countdown_Audio();
	void UpdateClock();
	void SetGlyphState(bool UseRunes);
	void ReceiveTick(float DeltaSeconds);
	void TestFinalStage();
	void FinalDisplay();
	void Stage2();
	void Start_Stage_2();
	void Handle_Stage_2_Trigger(const struct FTimespan& InTimespan);
	void Stage0();
	void Stage1();
	void ReceiveBeginPlay();
	void OnComplete_E48B2E7148EA6EDF202FC187F52CB949(class UUserWidget* UserWidget);
	void OnReady_EC1CCE594BD4D0523F5B9E8D00E05221(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnEventActive_788B00D4473A2A1ED7B696A04A059B99(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventUpdated_788B00D4473A2A1ED7B696A04A059B99(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventEnded_788B00D4473A2A1ED7B696A04A059B99(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void Fade__UpdateFunc();
	void Fade__FinishedFunc();
	void UserConstructionScript();
	void OnRep_Stage();
	void UpdateCounterVisuals();
	void OnRep_UseAlienNumberGlyphs();
	void UpdatePreShowLobbyMusic(bool ShouldPlay);
	void OnRep_IsPlayingBuffet();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpecialEvent_Countdown_Timer_C">();
	}
	static class ABP_SpecialEvent_Countdown_Timer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpecialEvent_Countdown_Timer_C>();
	}
};

}

