#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BuffetRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "BuffetRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class BuffetRuntime.FortBaseAnimInstance_LlamaRiderProp
// 0x0080 (0x03D0 - 0x0350)
class UFortBaseAnimInstance_LlamaRiderProp final : public UFortBaseAnimInstance
{
public:
	float                                         SkydiveAimYawLocal;                                // 0x0350(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSingleAnimStyle;                               // 0x0354(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BoostSpeed;                                        // 0x0358(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LlamaTrotSpeed;                                    // 0x035C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LlamaTrotSpeedTarget;                              // 0x0360(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAnimSequence*                          StartAnim;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          EnteranceAnim;                                     // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          HoldAnim;                                          // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEntering;                                       // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLanding;                                        // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UAnimSequence*                          LlamaPropStartLeft;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LlamaPropStartRight;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LlamaPropEnteranceLeft;                            // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LlamaPropEnteranceRight;                           // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LlamaPropHoldLeft;                                 // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LlamaPropHoldRight;                                // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LlamaTrotInterpSpeed;                              // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LlamaTrotSpeedTargetNormal;                        // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LlamaTrotSpeedTargetBoosted;                       // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DisableTurnAlphaCurve;                             // 0x03C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void PickLeftRight();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBaseAnimInstance_LlamaRiderProp">();
	}
	static class UFortBaseAnimInstance_LlamaRiderProp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBaseAnimInstance_LlamaRiderProp>();
	}
};

// Class BuffetRuntime.BuffetBubblePlayerMovementComponent
// 0x0090 (0x0180 - 0x00F0)
class UBuffetBubblePlayerMovementComponent final : public UMovementComponent
{
public:
	struct FScalableFloat                         TotalSplineTime;                                   // 0x00F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ClientElapsedTimeCatchUpRate;                      // 0x0118(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxDistanceAwayFromConstrainPoint;                 // 0x0140(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x0168(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsMovingAlongSpline;                              // 0x0170(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StartServerWorldTime;                              // 0x0174(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeOnSplineOffset;                                // 0x0178(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetIsMovingAlongSpline(const bool bNewIsMovingAlongSpline);
	void SetSplineComponent(const class USplineComponent* InSplineComponent, const float StartDistance);

	bool GetIsMovingAlongSpline() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuffetBubblePlayerMovementComponent">();
	}
	static class UBuffetBubblePlayerMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuffetBubblePlayerMovementComponent>();
	}
};

// Class BuffetRuntime.FortSineOscillateComponent
// 0x0190 (0x0390 - 0x0200)
class UFortSineOscillateComponent final : public USceneComponent
{
public:
	struct FScalableFloat                         DefaultCycleTime;                                  // 0x01F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxRandomCycleTimePercent;                         // 0x0220(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultMagnitude;                                  // 0x0248(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxRandomMagnitudePercent;                         // 0x0270(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                ComponentRelativeMovementDirection;                // 0x0298(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         bChooseRandomReversal;                             // 0x02A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bMoveOnAuthority;                                  // 0x02D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bOrientToTravelDirectionOnAuthority;               // 0x02F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bOrientToTravelDirectionOnProxy;                   // 0x0320(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         CycleTimeMultiplier;                               // 0x0348(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MagnitudeMultiplier;                               // 0x034C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bReverse;                                          // 0x0350(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ServerStartTime;                                   // 0x0354(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_358[0x4];                                      // 0x0358(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	uint8                                         bRecenterAndDeactivate : 1;                        // 0x035C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CycleTimeOverride;                                 // 0x0360(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MagnitudeOverride;                                 // 0x0364(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MagnitudeInterpSpeed;                              // 0x0368(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_36C[0x24];                                     // 0x036C(0x0024)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_bRecenterAndDeactivate();
	void OnRep_CycleTimeOverride(float PreviousCycleTimeOverride);
	void OverrideCycleTime(const float Value, const bool bAsMultiplier);
	void OverrideMagnitude(const float Value, const bool bAsMultiplier, const float InterpSpeed);
	void RecenterAndDeactivate();
	void ResetCycleTime();
	void ResetMagnitude(const float InterpSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSineOscillateComponent">();
	}
	static class UFortSineOscillateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSineOscillateComponent>();
	}
};

// Class BuffetRuntime.BuffetFlyingMovementComponent
// 0x0000 (0x0BB0 - 0x0BB0)
class UBuffetFlyingMovementComponent final : public UCharacterMovementComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuffetFlyingMovementComponent">();
	}
	static class UBuffetFlyingMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuffetFlyingMovementComponent>();
	}
};

// Class BuffetRuntime.BuffetFlyingPawn
// 0x0010 (0x04D0 - 0x04C0)
class ABuffetFlyingPawn final : public ACharacter
{
public:
	class UFortSpecialRelevancyPawnAttachComponent* SpecialRelevancyPawnAttachComponent;             // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BeginMovement(class AFortPlayerPawnAthena* InPlayerPawn);
	void EndMovement();
	void OnPlayerPawnDestroyed(class AActor* DestroyedActor);

	class AFortPlayerPawnAthena* GetPlayerPawn() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuffetFlyingPawn">();
	}
	static class ABuffetFlyingPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuffetFlyingPawn>();
	}
};

// Class BuffetRuntime.BuffetRacePlayerMovementComponent
// 0x02C0 (0x03B0 - 0x00F0)
class alignas(0x10) UBuffetRacePlayerMovementComponent final : public UMovementComponent
{
public:
	struct FVector                                TurnSpeed;                                         // 0x00F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SplineLocationOffsetZ;                             // 0x0100(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         TotalSplineTime;                                   // 0x0128(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         StartingSplinePoint;                               // 0x0150(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         ClientElapsedTimeCatchUpRate;                      // 0x0158(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class AActor*                                 TargetSplineActor;                                 // 0x0180(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuffetRacePlayerLocationData          LocalRacePlayerLocationData;                       // 0x0188(0x0010)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRepBuffetRacePlayerLocationData       ReplicatedRacePlayerLocationData;                  // 0x0198(0x0018)(Net, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FBuffetRacePlayerSpeedData             LocalCurrentSpeeds;                                // 0x01B0(0x0010)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FRepBuffetRacePlayerSpeedData          ReplicatedTargetSpeeds;                            // 0x01C0(0x0014)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SplineDistanceReplicationRecoveryPercent;          // 0x01D8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SplineDistanceReplicationRecoveryMinDistanceAlongPerSecond; // 0x0200(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SplineDistanceReplicationRecoveryMinAngularRollDistancePerSecond; // 0x0228(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SpeedTimeReplicationRecoveryPercent;               // 0x0250(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         GroundCheckDistance;                               // 0x0278(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxAngularRollDeltaFromServer;                     // 0x02A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         MaxAngularRollDistance;                            // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceAlongSplineFromBaseSplineDistance;      // 0x02CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SplineInterpStrength;                              // 0x02D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bScaleMaxAngularRollDistance;                      // 0x02F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIsMovingAlongSpline;                              // 0x0320(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_321[0x33];                                     // 0x0321(0x0033)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StartServerWorldTime;                              // 0x0354(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ReplicatedTotalSplineTime;                         // 0x0358(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ReplicatedSplineInterpStrength;                    // 0x035C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bReplicatedScaleMaxAngularRollDistance : 1;        // 0x0360(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_361[0xF];                                      // 0x0361(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRepBuffetRacePlayerLocationData       TeleportLocationData;                              // 0x0370(0x0018)(Net, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x28];                                     // 0x0388(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_ReplicatedTargetSpeeds();
	void OnRep_ReplicatedTrackMovement();
	void OnRep_TargetSplineActor();
	void OnRep_TeleportLocationData();
	void ServerTeleportPlayer(const float NewDistanceDeltaFromBaseSplineDistance, const float NewAngularRollDistance);
	void SetIsMovingAlongSpline(const bool bNewIsMovingAlongSpline);
	void SetSplineActor(class AActor* NewSplineActor);
	void SetTargetSpeeds(const struct FBuffetRacePlayerSpeedData& NewTargetSpeeds);

	float GetAngularRollDistance() const;
	float GetCurrentAngularRollSpeed() const;
	struct FVector GetCurrentGroundNormal() const;
	float GetDistanceAlongSpline() const;
	bool GetIsMovingAlongSpline() const;
	float GetScaledMaxAngularRollDistanceAtSplineDistance(const float SplineDistance) const;
	class USplineComponent* GetSpline() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuffetRacePlayerMovementComponent">();
	}
	static class UBuffetRacePlayerMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuffetRacePlayerMovementComponent>();
	}
};

// Class BuffetRuntime.FortMovementComp_SimpleSpline
// 0x0078 (0x0168 - 0x00F0)
class UFortMovementComp_SimpleSpline final : public UMovementComponent
{
public:
	struct FScalableFloat                         TotalSplineTime;                                   // 0x00F0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ClientCatchUpRate;                                 // 0x0118(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FSimpleSplineCrossedPercentCallbackData> CrossedPercentCallbacks;                  // 0x0148(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FSimpleSplineMovementReplicatedData    ReplicatedMovementData;                            // 0x0158(0x0010)(Net, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void RegisterCrossedPercentCallback(TDelegate<void(const class AActor* Owner, const struct FSimpleSplineOptionalData& OptionalData, const float Percent)> Delegate, const struct FSimpleSplineOptionalData& OptionalData, const float Percent);
	void SetSplineComponent(const class USplineComponent* InSplineComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementComp_SimpleSpline">();
	}
	static class UFortMovementComp_SimpleSpline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementComp_SimpleSpline>();
	}
};

// Class BuffetRuntime.FortPlayerAnimInstance_LlamaRider
// 0x0080 (0x1DA0 - 0x1D20)
class UFortPlayerAnimInstance_LlamaRider final : public UFortPlayerAnimInstance
{
public:
	float                                         PelvisBank;                                        // 0x1D18(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PelvisModRot;                                      // 0x1D1C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PelvisBankTarget;                                  // 0x1D28(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisStrafe;                                      // 0x1D2C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisStrafeTarget;                                // 0x1D30(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PelvisModTranslate;                                // 0x1D34(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LegLeftModRot;                                     // 0x1D40(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               LegRightModRot;                                    // 0x1D4C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SkydiveAimYawLocal;                                // 0x1D58(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostSpeed;                                        // 0x1D5C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSingleAnimStyle;                               // 0x1D60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInFallingLoop;                                  // 0x1D61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLanding;                                        // 0x1D62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoosting;                                       // 0x1D63(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisBankInterpSpeed;                             // 0x1D64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisBankLegPitchMultiplier;                      // 0x1D68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisStrafeInterpSpeed;                           // 0x1D6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkydiveAimYawMapInRangeA;                          // 0x1D70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkydiveAimYawMapInRangeB;                          // 0x1D74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkydiveAimYawMapOutRangeA;                         // 0x1D78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkydiveAimYawMapOutRangeB;                         // 0x1D7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ParaGlideLeanAlphaNearlyEqualTo;                   // 0x1D80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ParaGlideLeanAlphaNearlyEqualErrorTolerance;       // 0x1D84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostSpeedNormal;                                  // 0x1D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostSpeedBoosted;                                 // 0x1D8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostSpeedInterpSpeed;                             // 0x1D90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParaGlideLeanAlphaCurve;                           // 0x1D94(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9C[0x4];                                     // 0x1D9C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void Boost(float DeltaSeconds);
	void CheckDirection(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_LlamaRider">();
	}
	static class UFortPlayerAnimInstance_LlamaRider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_LlamaRider>();
	}
};

// Class BuffetRuntime.FortSpecialRelevancyAttachComponent
// 0x0040 (0x00F0 - 0x00B0)
class UFortSpecialRelevancyAttachComponent : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const class AActor* ParentActor, const class AActor* AttachedActor, const class FName& SocketName)> OnAttached; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* ParentActor, const class AActor* DetachedActor, const class FName& SocketName)> OnDetached; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                   AttachComponentTag;                                // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           SocketNames;                                       // 0x00D8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class USceneComponent*                        AttachComponent;                                   // 0x00E8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool AttachActor(class AActor* Actor, const EAttachmentRule LocationRule, const EAttachmentRule RotationRule, const EAttachmentRule ScaleRule, const bool bWeldSimulatedBodies);
	void AttachMultiSquadPawns(TArray<class AFortPlayerPawn*>* OutAttachedPawns, const int32 ControllerGroupIndex, const int32 PawnIndex, const EAttachmentRule LocationRule, const EAttachmentRule RotationRule, const EAttachmentRule ScaleRule, const bool bWeldSimulatedBodies);
	bool DetachActor(class AActor* Actor, const EDetachmentRule LocationRule, const EDetachmentRule RotationRule, const EDetachmentRule ScaleRule);
	void DetachAllActors(const TSubclassOf<class AActor> ActorClass, const EDetachmentRule LocationRule, const EDetachmentRule RotationRule, const EDetachmentRule ScaleRule);

public:
	static class UClass* StaticClass()
	{
