#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DynamicHUD

#include "Basic.hpp"


namespace SDK
{

// Enum DynamicHUD.EDynamicHUDComparison
// NumValues: 0x0004
enum class EDynamicHUDComparison : uint32
{
	Equal                                    = 0,
	LessOrEqual                              = 1,
	GreaterOrEqual                           = 2,
	EDynamicHUDComparison_MAX                = 3,
};

// Enum DynamicHUD.EDynamicHUDOperator
// NumValues: 0x0003
enum class EDynamicHUDOperator : uint32
{
	Addition                                 = 0,
	Substraction                             = 1,
	EDynamicHUDOperator_MAX                  = 2,
};

// Enum DynamicHUD.EDynamicHUDSide
// NumValues: 0x0005
enum class EDynamicHUDSide : uint32
{
	Top                                      = 0,
	Bottom                                   = 1,
	Left                                     = 2,
	Right                                    = 3,
	EDynamicHUDSide_MAX                      = 4,
};

// Enum DynamicHUD.EDynamicHUDAnchor
// NumValues: 0x000A
enum class EDynamicHUDAnchor : uint32
{
	TopLeft                                  = 0,
	TopCenter                                = 1,
	TopRight                                 = 2,
	CenterLeft                               = 3,
	CenterCenter                             = 4,
	CenterRight                              = 5,
	BottomLeft                               = 6,
	BottomCenter                             = 7,
	BottomRight                              = 8,
	EDynamicHUDAnchor_MAX                    = 9,
};

// Enum DynamicHUD.EDynamicHUDStrength
// NumValues: 0x0005
enum class EDynamicHUDStrength : uint32
{
	Weak                                     = 0,
	Medium                                   = 1,
	Strong                                   = 2,
	Required                                 = 3,
	EDynamicHUDStrength_MAX                  = 4,
};

// Enum DynamicHUD.EDynamicHUDZOrder
// NumValues: 0x0005
enum class EDynamicHUDZOrder : uint32
{
	Back                                     = 500,
	Middle                                   = 1000,
	Front                                    = 1500,
	Custom                                   = 2000,
	EDynamicHUDZOrder_MAX                    = 2001,
};

// ScriptStruct DynamicHUD.DirectorData
// 0x0038 (0x0038 - 0x0000)
struct FDirectorData final
{
public:
	TSoftClassPtr<class UClass>                   DirectorClass;                                     // 0x0000(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instance;                                          // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DynamicHUD.ContextData
// 0x0010 (0x0010 - 0x0000)
struct FContextData final
{
public:
	TArray<TWeakObjectPtr<class UObject>>         Contexts;                                          // 0x0000(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct DynamicHUD.DynamicHUDUnallowed
// 0x0038 (0x0038 - 0x0000)
struct FDynamicHUDUnallowed final
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUniqueID;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   UniqueId;                                          // 0x002C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeAll;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DynamicHUD.DynamicHUDAllowed
// 0x0050 (0x0050 - 0x0000)
struct FDynamicHUDAllowed final
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDZOrder                             ZOrder;                                            // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomZOrder;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnique;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   UniqueId;                                          // 0x0034(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSafeZone;                                      // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UDynamicHUDConstraintBase*>      LayoutConstraints;                                 // 0x0040(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

}

