#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GCNL_Athena_LlamaRoaster_Beam_Fire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_LlamaRoaster_Beam_Fire.GCNL_Athena_LlamaRoaster_Beam_Fire_C
// 0x0060 (0x0830 - 0x07D0)
class AGCNL_Athena_LlamaRoaster_Beam_Fire_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Hightower_Tomato_Secondary_Charge_FlyBy;           // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxRange;                                          // 0x07E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRotator                               SavedRotation;                                     // 0x0808(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 Pawn;                                              // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SavedPoint;                                        // 0x0820(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_LlamaRoaster_Beam_Fire(int32 EntryPoint);
	void Update_Audio_Location();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void ReceiveTick(float DeltaSeconds);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_LlamaRoaster_Beam_Fire_C">();
	}
	static class AGCNL_Athena_LlamaRoaster_Beam_Fire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_LlamaRoaster_Beam_Fire_C>();
	}
};

}

