#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GiftingUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "GiftingUI_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SocialUMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class GiftingUI.AthenaGiftConfirmedPanel
// 0x0028 (0x0360 - 0x0338)
class UAthenaGiftConfirmedPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_338[0x18];                                     // 0x0338(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftConfirmedPanel">();
	}
	static class UAthenaGiftConfirmedPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftConfirmedPanel>();
	}
};

// Class GiftingUI.AthenaGiftingConfirmationScreen
// 0x0150 (0x0488 - 0x0338)
class UAthenaGiftingConfirmationScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_338[0x28];                                     // 0x0338(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortStoreFrontOfferInfo*               PresentedGiftableOfferInfo;                        // 0x0360(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               PresentedOptionalTokenOfferInfo;                   // 0x0368(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0xBC];                                     // 0x0370(0x00BC)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MinGiftSubmissionDelay;                            // 0x042C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxGiftSubmissionDelay;                            // 0x0430(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_434[0x14];                                     // 0x0434(0x0014)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonLegacy*                    Button_WrapOptions;                                // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MtxWallet;                                  // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPurchasePanel*            Panel_GiftingPurchase;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingWrapOptionsPanel*         Panel_WrapOptions;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftConfirmedPanel*              Panel_GiftConfirmed;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingErrorsPanel*              Panel_GiftingErrors;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Dismiss();
	void HandleGiftSent(bool bSuccess, const TArray<class FString>& IneligibleAccounts, const TArray<class FString>& ErrorCodes);
	void HandleTokenOfferPurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void OnPresentationModeChanged(EGiftingPresentationMode NewMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingConfirmationScreen">();
	}
	static class UAthenaGiftingConfirmationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingConfirmationScreen>();
	}
};

// Class GiftingUI.AthenaGiftingErrorsPanel
// 0x0060 (0x0398 - 0x0338)
class UAthenaGiftingErrorsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_338[0x30];                                     // 0x0338(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Title;                                        // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Continue;                                   // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void UpdateGiftEligibility(bool bStillGiftable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingErrorsPanel">();
	}
	static class UAthenaGiftingErrorsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingErrorsPanel>();
	}
};

// Class GiftingUI.AthenaGiftingPriceWidget
// 0x0020 (0x02A8 - 0x0288)
class UAthenaGiftingPriceWidget final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_RealMoneyPrice;                               // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_FinalPrice;                                   // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RegularPrice;                                 // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_SalePrice;                                 // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPresentationMode(EGiftingPricePresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPriceWidget">();
	}
	static class UAthenaGiftingPriceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPriceWidget>();
	}
};

// Class GiftingUI.AthenaGiftingPurchaseButton
// 0x0010 (0x0C30 - 0x0C20)
class UAthenaGiftingPurchaseButton final : public UCommonButtonLegacy
{
public:
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x0C20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0C28(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchaseButton">();
	}
	static class UAthenaGiftingPurchaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchaseButton>();
	}
};

// Class GiftingUI.AthenaGiftingPurchasePanel
// 0x0048 (0x0380 - 0x0338)
class UAthenaGiftingPurchasePanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_338[0x18];                                     // 0x0338(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UAthenaGiftingPurchaseButton*           Button_PurchaseGift;                               // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SocialNameInfo;                               // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemsCount;                                   // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PlayIntroAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchasePanel">();
	}
	static class UAthenaGiftingPurchasePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchasePanel>();
	}
};

// Class GiftingUI.AthenaGiftingScreen
// 0x01C0 (0x0798 - 0x05D8)
class UAthenaGiftingScreen final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortGiftingUserSearchWidget*           SearchWidget_SocialSearchWidget;                   // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGiftingSocialUserListView*         ListView_Recipients;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_GiftingPolicy;                              // 0x0608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x0610(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_VBucksOffCount;                               // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ShownItemIndex;                               // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_NoContent;                                    // 0x0628(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OfferItemOwnedCount;                      // 0x0630(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Container_VBucksOffViolator;                       // 0x0638(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_GiftCount;                                // 0x0640(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                  Widget_ItemInfo;                                   // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_FilterTabs;                               // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsPrevious;                   // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsNext;                       // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingConfirmationScreen*       ActivatableWidget_GiftingConfirmation;             // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ItemCyclingInterval;                               // 0x0678(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDataTableRowHandle                    FilterTabsPreviousAction;                          // 0x0680(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    FilterTabsNextAction;                              // 0x0690(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class FText                                   RegularGiftingPolicy;                              // 0x06A0(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   BattlePassGiftingPolicy;                           // 0x06B8(0x0018)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D0[0x48];                                     // 0x06D0(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class UCommonButtonLegacy*, EFilterType> FilterMap;                                         // 0x0718(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupLegacy*               FilterGroup;                                       // 0x0768(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortItemDefinition*>            ItemDefinitions;                                   // 0x0770(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                    PresentedItemDefinition;                           // 0x0780(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               GiftableOfferInfo;                                 // 0x0788(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               OptionalTokenOfferInfo;                            // 0x0790(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFilterChanged(EFilterType FilterType);
	void OnFriendSelectionChanged();
	void OnPartyListUpdated(bool bEmpty);
	void OnPresentationModeChanged(EGiftingScreenPresentationMode Mode);
	void OnSetupFilterTabButton(class UCommonButtonLegacy* Button, EFilterType FilterType);
	void OnShownItemChanged();
	void OnShowSearchWarningText(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingScreen">();
	}
	static class UAthenaGiftingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingScreen>();
	}
};

// Class GiftingUI.AthenaGiftingWrapOptionsPanel
// 0x0068 (0x03A0 - 0x0338)
class UAthenaGiftingWrapOptionsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_338[0x28];                                     // 0x0338(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TSoftObjectPtr<class UFortGiftBoxItemDefinition>> GiftBoxes;                              // 0x0360(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortGiftBoxItemDefinition*>     GiftBoxItemDefs;                                   // 0x0370(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_380[0x10];                                     // 0x0380(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonLegacy*                    Button_ConfirmWrap;                                // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_WrapOptions;                              // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingWrapOptionsPanel">();
	}
	static class UAthenaGiftingWrapOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingWrapOptionsPanel>();
	}
};

// Class GiftingUI.FortGiftingSocialUserListEntry
// 0x00E8 (0x0D20 - 0x0C38)
class UFortGiftingSocialUserListEntry final : public USocialListEntryBase
{
public:
	uint8                                         Pad_C38[0xC0];                                     // 0x0C38(0x00C0)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x0CF8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x0D00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_EligibilityStatus;                        // 0x0D08(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OwnedItems;                               // 0x0D10(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x0D18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnHighlightedStateChanged(bool bInIsHighlighted, bool bPlayAnimation);
	void BP_OnTouchSelectionConfirmed();
	void OnRecipientStatusUpdated();
	void OnUserItemSet();
	void SetPresentationMode(ERecipientPresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListEntry">();
	}
	static class UFortGiftingSocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListEntry>();
	}
};

// Class GiftingUI.FortGiftingSocialUserListView
// 0x00F8 (0x0400 - 0x0308)
class UFortGiftingSocialUserListView final : public USocialUserListViewBase
{
public:
	float                                         RefreshRecipientStatusDelay;                       // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30C[0xF4];                                     // 0x030C(0x00F4)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListView">();
	}
	static class UFortGiftingSocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListView>();
	}
};

// Class GiftingUI.FortGiftingUserSearchWidget
// 0x0048 (0x02D0 - 0x0288)
class UFortGiftingUserSearchWidget final : public UCommonUserWidget
{
public:
	class UEditableText*                          EditableText_SearchFriends;                        // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ClearQuery;                                 // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SubmitQuery;                                // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0x30];                                     // 0x02A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleSearchFriendsTextChanged(const class FText& Text);
	void HandleSearchFriendsTextEntered(const class FText& Text, ETextCommit CommitMethod);
	void OnSearchCommit(bool bSearchStringShort);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingUserSearchWidget">();
	}
	static class UFortGiftingUserSearchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingUserSearchWidget>();
	}
};

// Class GiftingUI.FortGiftingWrapOptionListEntry
// 0x0018 (0x0C38 - 0x0C20)
class UFortGiftingWrapOptionListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_C20[0x8];                                      // 0x0C20(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortGiftBoxItemDefinition*             GiftBoxDefinition;                                 // 0x0C28(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       Image_Gift;                                        // 0x0C30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingWrapOptionListEntry">();
	}
	static class UFortGiftingWrapOptionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingWrapOptionListEntry>();
	}
};

// Class GiftingUI.FortGiftingData
// 0x0028 (0x04A8 - 0x0480)
class UFortGiftingData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   GiftingScreenClass;                                // 0x0480(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingData">();
	}
	static class UFortGiftingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingData>();
	}
};

}

