#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LagerRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerRegisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerUnregisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.EndEncounter
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_EndEncounter final
{
public:
	class UFortAthenaLivingWorldEncounterInstance* EncounterInstance;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerProviderDebugActor
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor final
{
public:
	int32                                         ProviderIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.OnPatrolPathAdded
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnPatrolPathAdded final
{
public:
	class AFortAthenaPatrolPath*                  PatrolPath;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.OnSpawnedActorDestroy
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnSpawnedActorDestroy final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.StartEncounter
// 0x0040 (0x0040 - 0x0000)
struct FortAthenaLivingWorldManager_StartEncounter final
{
public:
	TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterType;                             // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> EncounterPointProviders; // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
	class UFortAthenaLivingWorldEncounterInstance* ReturnValue;                                      // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldManager.TrySpawnEvent
// 0x0050 (0x0050 - 0x0000)
struct FortAthenaLivingWorldManager_TrySpawnEvent final
{
public:
	struct FDataTableRowHandle                    EventEntry;                                        // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             SpawnLocation;                                     // 0x0010(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LagerRuntime.FortAthenaLivingWorldManager.QueryEventBudget
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldManager_QueryEventBudget final
{
public:
	struct FDataTableRowHandle                    EventEntry;                                        // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	const class AActor*                           SpawnLocation;                                     // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetPointProviderLocation
// 0x000C (0x000C - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetPointProviderLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.OnSpawnedActor
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_OnSpawnedActor final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PositionFromProvider;                              // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.OnSpawnedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_OnSpawnedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetFiltersTags
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetFiltersTags final
{
public:
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0000(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetValidLocation
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetValidLocation final
{
public:
	struct FFortAthenaLivingWorldPointProviderFilterRules PointFilter;                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ActorDensityComputationRadius;                     // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutPosition;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OutRotation;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.IsEnabled
// 0x000C (0x000C - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_IsEnabled final
{
public:
	struct FFortAthenaLivingWorldPointProviderFilterRules PointFilter;                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.RemoveClosestPointProvidersToPoint
// 0x0014 (0x0014 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_RemoveClosestPointProvidersToPoint final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDistance;                                   // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointsToDisable;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.DoesStartEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_DoesStartEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.GetEnabledLinkedPointProviders
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_GetEnabledLinkedPointProviders final
{
public:
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> ReturnValue;        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.GetEnablerTags
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_GetEnablerTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.HasCompletedEvaluation
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_HasCompletedEvaluation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldVolume.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldVolume.OnPointProviderRegistered
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaLivingWorldVolume_OnPointProviderRegistered final
{
public:
	TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface> PointProvider;              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldVolume.SetEQSQueryConfigParam
// 0x000C (0x000C - 0x0000)
struct FortAthenaLivingWorldVolume_SetEQSQueryConfigParam final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldVolume.DoesStartEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldVolume_DoesStartEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaLivingWorldVolume.IsPointProviderEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldVolume_IsPointProviderEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortAthenaPatrolPathPointProvider.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaPatrolPathPointProvider_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerSpawn
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerTeleportTo
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerTeleportTo final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

