#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MadmanRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PhosphorusRuntime_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class MadmanRuntime.FortAthenaMutator_Madman
// 0x0000 (0x03D8 - 0x03D8)
class AFortAthenaMutator_Madman final : public AFortAthenaMutator_GameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Madman">();
	}
	static class AFortAthenaMutator_Madman* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Madman>();
	}
};

// Class MadmanRuntime.FortAthenaMutator_Madman_PlayerSpawnPod
// 0x01E8 (0x09C8 - 0x07E0)
class AFortAthenaMutator_Madman_PlayerSpawnPod final : public AFortAthenaMutator_PlayerSpawnPod
{
public:
	struct FScalableFloat                         InnerLandRadiusPercent;                            // 0x07E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OuterLandRadiusPercent;                            // 0x0808(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TeamLandWedgePercentUsed;                          // 0x0830(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bSpawnCampingWhenCampedSpawnLocationsAreReevaluated; // 0x0858(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampingNumberOfRespawnsTilSpawnLocationReevaluation; // 0x0880(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampingDistanceThreshold;                     // 0x08A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampingMinPercentOfCampersToForceSpawnLocationReevaluation; // 0x08D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampingMinNumberOfCampersToForceSpawnLocationReevaluation; // 0x08F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampingNumberOfSpawnLocationsToEvaluate;      // 0x0920(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_948[0x80];                                     // 0x0948(0x0080)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnGamePhaseChanged(EAthenaGamePhase NewPhase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Madman_PlayerSpawnPod">();
	}
	static class AFortAthenaMutator_Madman_PlayerSpawnPod* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Madman_PlayerSpawnPod>();
	}
};

// Class MadmanRuntime.FortPoiVolume_Madman
// 0x0008 (0x02B0 - 0x02A8)
class AFortPoiVolume_Madman final : public AFortPoiVolume
{
public:
	float                                         StartingSpawnYawAngle;                             // 0x02A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPoiVolume_Madman">();
	}
	static class AFortPoiVolume_Madman* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortPoiVolume_Madman>();
	}
};

// Class MadmanRuntime.SynchronizedTeleportPlayerComponent_Madman
// 0x0010 (0x0118 - 0x0108)
class USynchronizedTeleportPlayerComponent_Madman final : public USynchronizedTeleportPlayerComponent
{
public:
	class USoundMix*                              FirstLoadingScreenSoundMix;                        // 0x0108(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SynchronizedTeleportPlayerComponent_Madman">();
	}
	static class USynchronizedTeleportPlayerComponent_Madman* GetDefaultObj()
	{
		return GetDefaultObjImpl<USynchronizedTeleportPlayerComponent_Madman>();
	}
};

}

