#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NetCore

#include "Basic.hpp"


namespace SDK
{

// Enum NetCore.EFastArraySerializerDeltaFlags
// NumValues: 0x0005
enum class EFastArraySerializerDeltaFlags : uint8
{
	None                                     = 0,
	HasBeenSerialized                        = 1,
	HasDeltaBeenRequested                    = 2,
	IsUsingDeltaSerialization                = 4,
	EFastArraySerializerDeltaFlags_MAX       = 5,
};

// ScriptStruct NetCore.FastArraySerializerItem
// 0x000C (0x000C - 0x0000)
struct FFastArraySerializerItem
{
public:
	int32                                         ReplicationID;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplicationKey;                                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MostRecentArrayReplicationKey;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

struct FFastArraySerializerItem;

struct FFastArraySerializer
{
public:
    uint8 ItemMap[80];
    int32 IDCounter;
    int32 ArrayReplicationKey;
    char GuidReferencesMap[0x50];
    char GuidReferencesMap_StructDelta[0x50];

    int32 CachedNumItems;
    int32 CachedNumItemsToConsiderForWriting;

    EFastArraySerializerDeltaFlags DeltaFlags;

    uint8 _Padding1[0x7];

    void MarkItemDirty(FFastArraySerializerItem& Item, bool markArrayDirty = true)
    {
        if (Item.ReplicationID == -1)
        {
            Item.ReplicationID = ++IDCounter;
            if (IDCounter == -1)
            {
                IDCounter++;
            }
        }

        Item.ReplicationKey++;
        if (markArrayDirty) MarkArrayDirty();
    }

    void MarkArrayDirty()
    {
        ArrayReplicationKey++;
        if (ArrayReplicationKey == -1)
        {
            ArrayReplicationKey++;
        }

        CachedNumItems = -1;
        CachedNumItemsToConsiderForWriting = -1;
    }
};
// ScriptStruct NetCore.NetAnalyticsDataConfig
// 0x000C (0x000C - 0x0000)
struct FNetAnalyticsDataConfig final
{
public:
	class FName                                   DataName;                                          // 0x0000(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

