#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NetworkPrediction

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "NetworkPrediction_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class NetworkPrediction.NetworkPhysicsManager
// 0x60E0 (0x6110 - 0x0030)
class UNetworkPhysicsManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x60E0];                                    // 0x0030(0x60E0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPhysicsManager">();
	}
	static class UNetworkPhysicsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPhysicsManager>();
	}
};

// Class NetworkPrediction.TempMockComponent
// 0x0100 (0x01B0 - 0x00B0)
class UTempMockComponent final : public UActorComponent
{
public:
	struct FTempMockInputCmd                      PendingInputCmd;                                   // 0x00B0(0x0014)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnGeneratedLocalInputCmd;                          // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FNetworkPhysicsState                   NetworkPhysicsState;                               // 0x00E0(0x0060)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FTempMockObject                        SimOutput;                                         // 0x0140(0x0018)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FNetworkPredictionProxyAsync           ReplicatedObject;                                  // 0x0160(0x0040)(Net, NativeAccessSpecifierPrivate)
	class APlayerController*                      CachedPC;                                          // 0x01A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	float GetJumpCooldownMS() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempMockComponent">();
	}
	static class UTempMockComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempMockComponent>();
	}
};

// Class NetworkPrediction.NetworkPredictionComponent
// 0x01F0 (0x02A0 - 0x00B0)
class UNetworkPredictionComponent final : public UActorComponent
{
public:
	struct FNetworkPredictionProxy                NetworkPredictionProxy;                            // 0x00B0(0x00B0)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FReplicationProxy                      ReplicationProxy_ServerRPC;                        // 0x0160(0x0050)(Protected, NativeAccessSpecifierProtected)
	struct FReplicationProxy                      ReplicationProxy_Autonomous;                       // 0x01B0(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FReplicationProxy                      ReplicationProxy_Simulated;                        // 0x0200(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FReplicationProxy                      ReplicationProxy_Replay;                           // 0x0250(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)

public:
	void ServerReceiveClientInput(const struct FServerReplicationRPCParameter& ProxyParameter);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionComponent">();
	}
	static class UNetworkPredictionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionComponent>();
	}
};

// Class NetworkPrediction.NetworkPredictionPhysicsComponent
// 0x0120 (0x01D0 - 0x00B0)
class UNetworkPredictionPhysicsComponent final : public UActorComponent
{
public:
	struct FNetworkPredictionProxy                NetworkPredictionProxy;                            // 0x00B0(0x00B0)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    UpdatedPrimitive;                                  // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FReplicationProxy                      ReplicationProxy;                                  // 0x0170(0x0050)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionPhysicsComponent">();
	}
	static class UNetworkPredictionPhysicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionPhysicsComponent>();
	}
};

// Class NetworkPrediction.NetworkPredictionReplicatedManager
// 0x0010 (0x0230 - 0x0220)
class ANetworkPredictionReplicatedManager final : public AActor
{
public:
	struct FSharedPackageMap                      SharedPackageMap;                                  // 0x0220(0x0010)(Net, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionReplicatedManager">();
	}
	static class ANetworkPredictionReplicatedManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANetworkPredictionReplicatedManager>();
	}
};

// Class NetworkPrediction.NetworkPredictionSettingsObject
// 0x0038 (0x0060 - 0x0028)
class UNetworkPredictionSettingsObject final : public UObject
{
public:
	struct FNetworkPredictionSettings             Settings;                                          // 0x0028(0x0028)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FNetworkPredictionDevHUD>       DevHUDs;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionSettingsObject">();
	}
	static class UNetworkPredictionSettingsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionSettingsObject>();
	}
};

// Class NetworkPrediction.NetworkPredictionWorldManager
// 0x0638 (0x0668 - 0x0030)
class UNetworkPredictionWorldManager final : public UWorldSubsystem
{
public:
	class ANetworkPredictionReplicatedManager*    ReplicatedManager;                                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x630];                                     // 0x0038(0x0630)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionWorldManager">();
	}
	static class UNetworkPredictionWorldManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionWorldManager>();
	}
};

}

