#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NPC_VoiceComponent

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_VoiceComponent.NPC_VoiceComponent_C
// 0x0028 (0x00E0 - 0x00B8)
class UNPC_VoiceComponent_C final : public UFortAIComponent_Voice
{
public:
	class UFortTaggedSoundBank*                   DeprecatedBPSoundBank;                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachComponent;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerTimeThreshold;                              // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastTriggerTime;                                   // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Component;                                   // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundEffectSourcePresetChain*          SourceChainToApply;                                // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayVoiceLine(const struct FGameplayTag& Gameplay_Tag, class UAudioComponent* AudioComponent, bool* Success);
	void Deprecated_Set_Sound_Bank(class UFortTaggedSoundBank* SoundBank);
	void Internal_Get_Voice_Sound_Bank(class UFortTaggedSoundBank** Sound_Bank);
	void SetSourceEffectChainToApply(class USoundEffectSourcePresetChain* SourceEffectChain);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_VoiceComponent_C">();
	}
	static class UNPC_VoiceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_VoiceComponent_C>();
	}
};

}

