#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Prj_GravyGoblin_Holder

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayMessages_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GravyGoblin_HolderInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_GravyGoblin_Holder.Prj_GravyGoblin_Holder_C
// 0x0600 (0x1480 - 0x0E80)
class APrj_GravyGoblin_Holder_C final : public AFortGravityGunHolder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_GravityGoblin_Holder;                           // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortLayeredAudioComponent*             MovementAudio;                                     // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_GoingBack_D3F477DF43204522E9E0288A2751DAA3; // 0x0E98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Scale_D3F477DF43204522E9E0288A2751DAA3; // 0x0E9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_D3F477DF43204522E9E0288A2751DAA3; // 0x0EA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA1[0x7];                                      // 0x0EA1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnOnADSEffects__Timeline_9EC8DEF7400602C2DB1EE298ADD19CB5; // 0x0EB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TurnOnADSEffects___Direction_9EC8DEF7400602C2DB1EE298ADD19CB5; // 0x0EB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB5[0x3];                                      // 0x0EB5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     TurnOnADSEffects_;                                 // 0x0EB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrowRing_Wobble_133666AB4981783E242F51AFE8ECD046;  // 0x0EC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrowRing_Scale_133666AB4981783E242F51AFE8ECD046;   // 0x0EC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            GrowRing__Direction_133666AB4981783E242F51AFE8ECD046; // 0x0EC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC9[0x7];                                      // 0x0EC9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     GrowRing;                                          // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cached_StartingScale;                              // 0x0ED8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cached_EndingScale;                                // 0x0EDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RingSizeMultiplier;                                // 0x0EE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoldRightDistance;                                 // 0x0EE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Cached_HeldObjectRotation;                         // 0x0EE8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Cached_DT;                                         // 0x0EF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinRingSize;                                       // 0x0EF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlipRotation;                                      // 0x0EFC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EFD[0x3];                                      // 0x0EFD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CatchingSize;                                      // 0x0F00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F04[0x4];                                      // 0x0F04(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerCameraManager*                   PlayerCameraManager;                               // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GoalLocation;                                      // 0x0F10(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentRightDistance;                              // 0x0F1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentUpDistance;                                 // 0x0F20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentForwardDistance;                            // 0x0F24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0F28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Cached_WobbleObject;                               // 0x0F29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2A[0x2];                                      // 0x0F2A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         HeldObjectMass;                                    // 0x0F2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedMultiplierFromSize;                           // 0x0F30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F34[0x4];                                      // 0x0F34(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortGameplayEffectContainerSpec       Effect_Container_Spec_to_Apply_on_Hit;             // 0x0F38(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortGameplayEffectContainerSpec       Effect_Container_Spec_to_Apply_on_Explode;         // 0x0FF0(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABGA_Athena_Physics_Parent_C*           DummyObject;                                       // 0x10A8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          Dropped;                                           // 0x10B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WasCaught;                                         // 0x10B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B2[0x2];                                     // 0x10B2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         FX_ADSSpeed;                                       // 0x10B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortGameplayEffectContainerSpec> Additional_Explode_Effects;                      // 0x10B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AB_GravyGoblin_Athena_C*                Weapon;                                            // 0x10C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GoingBack;                                         // 0x10D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D1[0x3];                                     // 0x10D1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRotator                               CachedStartRotation;                               // 0x10D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FScalableFloat                         SizeToSpeedMultiplier_Min;                         // 0x10E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_Max;                         // 0x1108(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_SizeCieling;                 // 0x1130(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_SizeFloor;                   // 0x1158(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         SizeToSpeedMultiplier_Magnitude;                   // 0x1180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1184[0x4];                                     // 0x1184(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            SizeToSpeedMultiplier_Curve;                       // 0x1188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGravityGunHolderRotationAxis                 MaxAxis;                                           // 0x1190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1191[0x3];                                     // 0x1191(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MaxRingSize;                                       // 0x1194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SizeToSpeedMultiplier_SmallMultiplier;             // 0x1198(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_AverageMultiplier;           // 0x11C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_MediumMultiplier;            // 0x11E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_LargeMultiplier;             // 0x1210(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SwapInDummyOnInit;                                 // 0x1238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1239[0x7];                                     // 0x1239(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 OriginalPickup;                                    // 0x1240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OriginalProjectile;                                // 0x1248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FullyInitialized;                                  // 0x1250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1251[0x7];                                     // 0x1251(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         VehiclesMoveUpWhenADS;                             // 0x1258(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ADSUpDistanceMultiplier;                           // 0x1280(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ADSUpDistanceMax;                                  // 0x12A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_LargeVehicleMultiplier;      // 0x12D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_MediumVehicleMultiplier;     // 0x12F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SizeToSpeedMultiplier_PickupMultiplier;            // 0x1320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundCue*                              ObjectLaunchSound;                                 // 0x1348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventMessageTag                       HeldObjectRotatable;                               // 0x1350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FEventMessageTag                       HeldObjectUnrotatable;                             // 0x1358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DropObjectWhenConnectionCutOff;                    // 0x1360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DropObjectWhenConnectionCutOff_UpdateTime;         // 0x1388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DontLaunchIfConnectionCutOff;                      // 0x13B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DropIfProjectileNoLongerInUse;                     // 0x13D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HoldingObject;                                     // 0x1400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1401[0x7];                                     // 0x1401(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           ConnectionCheckTimer;                              // 0x1408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         IgnoreCollisionWithPlayerHolding;                  // 0x1410(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGravyGoblin_HolderInfo                HolderInfo;                                        // 0x1438(0x0020)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         UseRepNotifyInitialization;                        // 0x1458(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Prj_GravyGoblin_Holder(int32 EntryPoint);
	void ReceiveBeginPlay();
	void TractorLaunchQuestEvent();
	void Quest_ToiletOrTractor(class AActor* Held_Object);
	void ToiletLaunchQuestEvent();
	void TurnBackOnHoldingPawnCollision_Multicast();
	void IgnoreHoldingPawnCollision_Multicast();
	void CheckForConnectionCut();
	void HeldObjectDestroyed(class AActor* DestroyedActor);
	void BndEvt__MovementAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature(class UAudioComponent* AudioComponent, class FName ParameterName, int32 OneshotIndex);
	void DropObjectMulticast();
	void FirePressedRemoteClients();
	void ADSReleasedRemoteClients();
	void ADSPressedRemoteClients();
	void TurnOffADSEffects();
	void TurnOnADSEffects();
	void HeldObjectDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void PickUpDestroyedServer();
	void PickUpDestroyed(class AActor* DestroyedActor);
	void DropObject();
	void Initialize2(class AActor* HeldObject_0, class AActor* OwningPlayer_0, EGravityGunHolderObjectType ObjectType, class UClass* ProjectileClass);
	void Detach();
	void InitializeVariables(class AActor* Held_Object, class AActor* OwningPlayer_0, EGravityGunHolderObjectType ObjectTypeHeld_0, class UClass* PrjClass);
	void Grow_Ring(bool WobbleObject);
	void Fired();
	void RotatePressed();
	void ADSReleased();
	void ADSPressed();
	void attach();
	void Initialize(class AActor* HeldObject_0, class AActor* OwningPlayer_0, EGravityGunHolderObjectType ObjectType, class UClass* ProjectileClass, const struct FFortGameplayEffectContainerSpec& Effect_Container_Spec_to_Apply_on_Hit_0, const struct FFortGameplayEffectContainerSpec& Effect_Container_Spec_to_Apply_on_Explode_0, const TArray<struct FFortGameplayEffectContainerSpec>& AdditionalExplodeEffects);
	void ReceiveDestroyed();
	void FireReleased();
	void FirePressed();
	void Removed_7B9C74D443751046F17498AB99970C3C();
	void Timeline_0__ReshowRing__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void TurnOnADSEffects___UpdateFunc();
	void TurnOnADSEffects___FinishedFunc();
	void GrowRing__HasObject__EventFunc();
	void GrowRing__UpdateFunc();
	void GrowRing__FinishedFunc();
	void UserConstructionScript();
	void GetHeldObjectBoundingBox(class AActor* Actor, struct FVector* BoundingBoxExtents);
	void InitializeRingSizeAndRotation();
	void OnRep_NewHeldObject();
	void HandleGrabOrCaughtAudio();
	void GetPhysicsObjectSize(class AActor* PhysicsObject, int32* Size);
	void SwapInDummyObject();
	void Ignore_Holding_Pawn_Collision();
	void TurnBackOnHoldingPawnCollision();
	void OnRep_HolderInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_GravyGoblin_Holder_C">();
	}
	static class APrj_GravyGoblin_Holder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_GravyGoblin_Holder_C>();
	}
};

}

