#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Prj_GravyGoblin_Grabber

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Proj_FortProjectileBase_Perf_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_GravyGoblin_Grabber.Prj_GravyGoblin_Grabber_C
// 0x02E8 (0x0B68 - 0x0880)
class APrj_GravyGoblin_Grabber_C final : public AProj_FortProjectileBase_Perf_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGravityGunTargetTrackingComponent*     GravityGunTargetTracking;                          // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GravyGoblin_Grabber_Glow;                       // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RingLeft;                                          // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RingRight;                                         // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ring1;                                             // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MoveToWeapon_Alpha_EA3148CE46FC8091A6AAAD911A3F2818; // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveToWeapon__Direction_EA3148CE46FC8091A6AAAD911A3F2818; // 0x08BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BD[0x3];                                      // 0x08BD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     MoveToWeapon;                                      // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 GrabbedObject;                                     // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APrj_GravyGoblin_Holder_C*              SpawnedHolder;                                     // 0x08D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnedHolder_;                                    // 0x08D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         ExtraTurnaroundTimeWhenHoming;                     // 0x08E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 HomingTarget;                                      // 0x0908(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetHomingOffset;                                // 0x0910(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnedAround;                                      // 0x091C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BuiltinHoming;                                     // 0x091D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CustomHoming;                                      // 0x091E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91F[0x1];                                      // 0x091F(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         OriginalVelocity;                                  // 0x0920(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_924[0x4];                                      // 0x0924(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortGameplayEffectContainerSpec       Effect_Container_Spec_to_Apply_on_Explode;         // 0x0928(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          StoppedAudio;                                      // 0x09E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAudioComponent*                        InAirAudio;                                        // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedStartLocation;                               // 0x09F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9FC[0x4];                                      // 0x09FC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UStaticMeshComponent*                   WeaponRing;                                        // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InterpingBack;                                     // 0x0A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A09[0x3];                                      // 0x0A09(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CachedDT;                                          // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_GravyGoblin_Athena_C*                Weapon;                                            // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cached_SpeedBeforeInterp;                          // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1C[0x4];                                      // 0x0A1C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SpeedWhileHoming;                                  // 0x0A20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DistanceToStartInterping;                          // 0x0A48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerPullForce;                                   // 0x0A70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerPullForce_UpMultiplier;                      // 0x0A98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Player_Failed_Reason;                              // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         TurnaroundTime;                                    // 0x0AE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Homing_DistanceToAttach;                           // 0x0B08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DistanceToReattachRingToWeapon;                    // 0x0B30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 ClonedObject;                                      // 0x0B58(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnedHolderIsLate;                               // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B61[0x3];                                      // 0x0B61(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BuiltinHomingToAttach;                             // 0x0B64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_GravyGoblin_Grabber(int32 EntryPoint);
	void Start_In_Air_Audio_Server();
	void Stop_Interping();
	void SpawnHolder_(class AActor* GrabbedObject_0);
	void ForceTurnaround();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void SpawnHolderServer(class AActor* GrabbedObject_0);
	void ReceiveTick(float DeltaSeconds);
	void TurnAround();
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void MoveToWeapon__UpdateFunc();
	void MoveToWeapon__FinishedFunc();
	void SetHomingVars(class AActor* HomingTarget_0);
	void OnRep_HomingTarget();
	void Get_Prj_Info(class UClass** Class_0, struct FFortGameplayEffectContainerSpec* EffectContainerSpecToApplyOnTouch_0, struct FFortGameplayEffectContainerSpec* EffectContainerSpecToApplyOnExplode_0, TArray<struct FFortGameplayEffectContainerSpec>* AdditionalExplodeEffectContainers_0);
	void StartInAirAudio();
	void StopInAirAudio(bool Play_Loop_Stop);
	void UpdateInAirAudio();
	void OnRep_ClonedObject();
	void OnRep_SpawnedHolder();
	void InitializeHolder();
	void OnRep_Test();
	class AActor* Get_Owning_Player();

	class UFortProjectileMovementComponent* GetFortProjectileMovementComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_GravyGoblin_Grabber_C">();
	}
	static class APrj_GravyGoblin_Grabber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_GravyGoblin_Grabber_C>();
	}
};

}

