#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Prj_Athena_Scooter

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Prj_Athena_Lotus_Scooter_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_Scooter.Prj_Athena_Scooter_C
// 0x00F0 (0x0B90 - 0x0AA0)
class APrj_Athena_Scooter_C final : public APrj_Athena_Lotus_Scooter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_Scooter_C;               // 0x0AA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        InAirAudioLoop;                                    // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Scooter_ProjLaunch;                             // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NearDeathBlink;                                    // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Duration;                                          // 0x0AC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxBounceVelocity;                                 // 0x0AE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinBounceVelocity;                                 // 0x0B10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                SavedVelocity;                                     // 0x0B38(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SavedNormal;                                       // 0x0B44(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SavedDot;                                          // 0x0B50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Water_Cue;                                         // 0x0B54(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5C[0x4];                                      // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SpawnPhysicsObject;                                // 0x0B60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           DestroyedCue;                                      // 0x0B88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_Athena_Scooter(int32 EntryPoint);
	void ReceiveDestroyed();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void NearDeathFx();
	void ReceiveBeginPlay();
	void OnBounce(const struct FHitResult& Hit);
	void BndEvt__ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void CustomEvent_0(class AActor* DestroyedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_Scooter_C">();
	}
	static class APrj_Athena_Scooter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_Scooter_C>();
	}
};

}

