#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialScreenSectionWhosGoing

#include "Basic.hpp"


namespace SDK::Params
{

// Function SocialScreenSectionWhosGoing.SocialScreenSectionWhosGoing_C.ExecuteUbergraph_SocialScreenSectionWhosGoing
// 0x0020 (0x0020 - 0x0000)
struct SocialScreenSectionWhosGoing_C_ExecuteUbergraph_SocialScreenSectionWhosGoing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInSelectedState;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SocialScreenSectionWhosGoing.SocialScreenSectionWhosGoing_C.OnSelectedStateUpdated
// 0x0001 (0x0001 - 0x0000)
struct SocialScreenSectionWhosGoing_C_OnSelectedStateUpdated final
{
public:
	bool                                          bIsInSelectedState;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

