#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SpecialEventGameplayUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// Class SpecialEventGameplayUI.FortGameplayCinematicHostWidget
// 0x0030 (0x02F8 - 0x02C8)
class UFortGameplayCinematicHostWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonActivatablePanelLegacy> IntroPanelWidgetClass;                          // 0x02D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonActivatablePanelLegacy> OutroPanelWidgetClass;                          // 0x02D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaLoadingScreenItemDefinition*     LoadingScreenDefinition;                           // 0x02E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8[0x10];                                     // 0x02E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnPanelDeactivated(class UCommonActivatablePanelLegacy* DeactivatedPanel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCinematicHostWidget">();
	}
	static class UFortGameplayCinematicHostWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCinematicHostWidget>();
	}
};

// Class SpecialEventGameplayUI.FortGameplayIntroPanelWidget
// 0x0020 (0x0490 - 0x0470)
class UFortGameplayIntroPanelWidget final : public UCommonActivatablePanelLegacy
{
public:
	uint8                                         Pad_470[0x20];                                     // 0x0470(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnIntroFinished();
	void OnStartIntro();
	void OnWaitingForMinTime();
	void OnWaitingForPawn();
	void OnWaitingForReadyForGameplay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayIntroPanelWidget">();
	}
	static class UFortGameplayIntroPanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayIntroPanelWidget>();
	}
};

// Class SpecialEventGameplayUI.FortGameplayOutroPanelWidget
// 0x0010 (0x0480 - 0x0470)
class UFortGameplayOutroPanelWidget final : public UCommonActivatablePanelLegacy
{
public:
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnOutroFinished();
	void OnStartOutro();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayOutroPanelWidget">();
	}
	static class UFortGameplayOutroPanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayOutroPanelWidget>();
	}
};

}

