#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SpecialEventGameplayRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum SpecialEventGameplayRuntime.EMutatorMovementMode
// NumValues: 0x0006
enum class EMutatorMovementMode : uint8
{
	None                                     = 0,
	BuffetBubbles                            = 15,
	BuffetBubblesIntro                       = 16,
	BuffetFlying                             = 17,
	BuffetFlyingRicochet                     = 18,
	EMutatorMovementMode_MAX                 = 19,
};

// Enum SpecialEventGameplayRuntime.ESpecialEventPhaseState
// NumValues: 0x0005
enum class ESpecialEventPhaseState : uint8
{
	Unregistered                             = 0,
	Inactive                                 = 1,
	Active                                   = 2,
	Deactivated                              = 3,
	ESpecialEventPhaseState_MAX              = 4,
};

// Enum SpecialEventGameplayRuntime.EScriptStartupState
// NumValues: 0x0004
enum class EScriptStartupState : uint8
{
	WaitingForWarmupToEnd                    = 0,
	PreShow                                  = 1,
	ShowTime                                 = 2,
	EScriptStartupState_MAX                  = 3,
};

// ScriptStruct SpecialEventGameplayRuntime.BuffetFlyingRicochetReplicatedData
// 0x0010 (0x0010 - 0x0000)
struct FBuffetFlyingRicochetReplicatedData final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialClientEvent
// 0x0018 (0x0018 - 0x0000)
struct FSpecialClientEvent final
{
public:
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeSeconds;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventTag;                                          // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.FortSpecialEventGEData
// 0x0010 (0x0010 - 0x0000)
struct FFortSpecialEventGEData final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffect;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.FortSpecialEventOverrideParts
// 0x0020 (0x0020 - 0x0000)
struct FFortSpecialEventOverrideParts final
{
public:
	TArray<class UCustomCharacterPart*>           OverrideParts;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FFortSpecialEventGEData                GameplayEffectToApplyOnSwap;                       // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.FortDelayRTMMData
// 0x0010 (0x0010 - 0x0000)
struct FFortDelayRTMMData final
{
public:
	bool                                          bDelayRTTM;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MinRTTMDelay;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRTTMDelay;                                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timestamp;                                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.BuffetBubblesDebugData
// 0x0080 (0x0080 - 0x0000)
struct alignas(0x10) FBuffetBubblesDebugData final
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.BuffetBubblesReplicatedData
// 0x0040 (0x0040 - 0x0000)
struct FBuffetBubblesReplicatedData final
{
public:
	struct FTransform                             RelativeTransform;                                 // 0x0000(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RelativeVelocity;                                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.PhaseLevelEntry
// 0x00A0 (0x00A0 - 0x0000)
struct FPhaseLevelEntry final
{
public:
	TSoftObjectPtr<class UWorld>                  LevelToLoad;                                       // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelName;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadLevelOnScriptStart;                           // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLevelStartsVisible;                               // 0x0039(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnloadLevelOnPhaseEnd;                            // 0x003A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  MakeVisibleAtPhaseTags;                            // 0x0040(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UnloadLevelAtPhaseTags;                            // 0x0060(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0080(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x008C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class ULevelStreamingDynamic*                 LevelInstance;                                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.PhaseInfo
// 0x0060 (0x0060 - 0x0000)
struct FPhaseInfo final
{
public:
	TSubclassOf<class ASpecialEventPhase>         PhaseActorClass;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PhaseTag;                                          // 0x0008(0x0008)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SequenceTime;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpecialRelevancyMode                         RelevancyMode;                                     // 0x0014(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NumOfSquadsInRelevancyGroup;                       // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  RequireLevelsFromPhaseTags;                        // 0x0020(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bStartNextPhaseOnPhaseFinished;                    // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPhaseLevelEntry>               Levels;                                            // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class ASpecialEventPhase*                     PhaseActor;                                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.ScriptStartUpStateMessage
// 0x0001 (0x0001 - 0x0000)
struct FScriptStartUpStateMessage final
{
public:
	EScriptStartupState                           StartupState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

