#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: TitaniumRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class TitaniumRuntime.FortAthenaMutator_Titanium
// 0x0038 (0x0410 - 0x03D8)
class AFortAthenaMutator_Titanium final : public AFortAthenaMutator_GameModeBase
{
public:
	class UDataTable*                             UpgradeTable;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ValidWeaponTags;                                   // 0x03E0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EFortRarity                                   HighestUpgradeTier;                                // 0x0400(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UGameplayEffect>            UpgradedGameplayEffect;                            // 0x0408(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Titanium">();
	}
	static class AFortAthenaMutator_Titanium* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Titanium>();
	}
};

// Class TitaniumRuntime.TitaniumPlayerComponent
// 0x0010 (0x00C0 - 0x00B0)
class UTitaniumPlayerComponent final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(const class UFortWorldItemDefinition* UpgradedWeapon)> OnPlayerEarnedElimination; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void Client_PlayerEarnedElimination(const class UFortWorldItemDefinition* UpgradedWeapon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TitaniumPlayerComponent">();
	}
	static class UTitaniumPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTitaniumPlayerComponent>();
	}
};

}

