#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Athena_CageSaddle_BallPrototype

#include "Basic.hpp"

#include "BGA_Athena_Physics_Parent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_CageSaddle_BallPrototype.Athena_CageSaddle_BallPrototype_C
// 0x0028 (0x08F8 - 0x08D0)
class AAthena_CageSaddle_BallPrototype_C final : public ABGA_Athena_Physics_Parent_C
{
public:
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_CageSaddle_BallPrototype_C;  // 0x08D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Pivot;                                             // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        MyOwner;                                           // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Clipping;                                          // 0x08E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           UpdateTimer;                                       // 0x08F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_CageSaddle_BallPrototype(int32 EntryPoint);
	void Turn_Off();
	void TurnOn();
	void UpdatePlayerPosition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_CageSaddle_BallPrototype_C">();
	}
	static class AAthena_CageSaddle_BallPrototype_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_CageSaddle_BallPrototype_C>();
	}
};

}

