#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Athena_Lotus_Scooter_Weap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Lotus_Scooter_Weap.B_Athena_Lotus_Scooter_Weap_C
// 0x0030 (0x13F0 - 0x13C0)
class AB_Athena_Lotus_Scooter_Weap_C : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Athena_Lotus_Scooter_Weap_C;      // 0x13C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         CurrentAmmo;                                       // 0x13C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MarkedPlayerCount;                                 // 0x13CC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         MarkedActors;                                      // 0x13D0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	class UMaterialInstanceDynamic*               ScreenMaterial;                                    // 0x13E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScreenCounterIndex;                                // 0x13E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayerAlreadyMarked;                              // 0x13EC(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Athena_Lotus_Scooter_Weap(int32 EntryPoint);
	void Ammo_Changed(int32 LocalCount, int32 LocalRemaining);
	void ReceiveBeginPlay();
	void OnRep_MarkedPlayerCount();
	void OnIndicatedActorAdded(class AActor* IndicatedActor);
	void OnIndicatedActorRemoved(class AActor* IndicatedActor);
	void OnRep_MarkedActors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_Lotus_Scooter_Weap_C">();
	}
	static class AB_Athena_Lotus_Scooter_Weap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Lotus_Scooter_Weap_C>();
	}
};

}

