#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Prj_ValetMod_OffRoadTire

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "B_Prj_Athena_BGASpawner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_ValetMod_OffRoadTire.B_Prj_ValetMod_OffRoadTire_C
// 0x0150 (0x0A50 - 0x0900)
class AB_Prj_ValetMod_OffRoadTire_C final : public AB_Prj_Athena_BGASpawner_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_ValetMod_OffRoadTire_C;       // 0x0900(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tire;                                              // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ModTagToApply;                                     // 0x0918(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedToStop;                                       // 0x0920(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerLaunchMultiplier;                            // 0x0924(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerLaunchZMultiplier;                           // 0x0928(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92C[0x4];                                      // 0x092C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FName>                           TireFXSocketArray;                                 // 0x0930(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ShouldTirePilesBeStackable;                        // 0x0940(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ShouldLaunchHitPlayer;                             // 0x0968(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HitPlayerLaunchMag;                                // 0x0990(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HitPlayerLaunchZMulti;                             // 0x09B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          EnteredWater;                                      // 0x09E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Hit;                                               // 0x09E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E2[0x6];                                      // 0x09E2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortWorldItemDefinition*               TireModWID;                                        // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         WaterSplashFX;                                     // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDagwoodVehicle*                    HitVehicle;                                        // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FScalableFloat                         HotfixSpawnPickUpIfStuckOnVehicle;                 // 0x0A00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ShouldApplyForay;                                  // 0x0A28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Prj_ValetMod_OffRoadTire(int32 EntryPoint);
	void SpawnPickupMod();
	void ResetHitVehicle();
	void ReceiveBeginPlay();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void HasEnteredWater();
	void ParentHit();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit_0);
	void OnStop(const struct FHitResult& Hit_0);
	void PickValetTireToApply(class AFortDagwoodVehicle* Vehicle);
	struct FVector CalculateLaunchVelocity(class AFortPawn* PlayerPawn);
	bool ShouldApplyMod(class AFortDagwoodVehicle* Vehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_ValetMod_OffRoadTire_C">();
	}
	static class AB_Prj_ValetMod_OffRoadTire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_ValetMod_OffRoadTire_C>();
	}
};

}

