#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BadgerBangsLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C
// 0x1DE0 (0x21D0 - 0x03F0)
class UBadgerBangsLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x03F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0428(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0540(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0570(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0688(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x06B8(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x07D0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x08E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0918(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0A30(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0A60(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0AE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0B10(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0B90(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0BC0(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0C40(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0C70(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0CF0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0D20(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0E38(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0E68(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0F80(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0FB0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x10C8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x10F8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x1128(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1158(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x1188(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x11B8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x11E8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1218(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1248(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1278(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x12A8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x12D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x1308(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1420(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x1450(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1568(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1598(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x16B0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x16E0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x17F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1828(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1940(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1970(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1A88(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1AB8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1BD0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1C00(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1D18(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1D48(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1E60(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1E90(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1FA8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1FD8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x20F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2120(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x21A0(0x0030)()

public:
	void ExecuteUbergraph_BadgerBangsLayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BadgerBangsLayerAnimBP_C">();
	}
	static class UBadgerBangsLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadgerBangsLayerAnimBP_C>();
	}
};

}

