#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePassBase

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum BattlePassBase.EBattlePassLandingPageSpecialEntryType
// NumValues: 0x0006
enum class EBattlePassLandingPageSpecialEntryType : uint8
{
	None                                     = 0,
	Subscription                             = 1,
	CharacterCustomizer                      = 2,
	SpecialCharacter                         = 3,
	COUNT                                    = 4,
	EBattlePassLandingPageSpecialEntryType_MAX = 5,
};

// Enum BattlePassBase.BattlePassTileAvailabilityStates
// NumValues: 0x0005
enum class EBattlePassTileAvailabilityStates : uint8
{
	Invalid                                  = 0,
	Available                                = 1,
	Owned                                    = 2,
	Locked                                   = 3,
	BattlePassTileAvailabilityStates_MAX     = 4,
};

// ScriptStruct BattlePassBase.BattlePassLandingPageEntryPreviewInfo
// 0x0040 (0x0040 - 0x0000)
struct FBattlePassLandingPageEntryPreviewInfo final
{
public:
	EBattlePassLandingPageSpecialEntryType        SpecialEntryType;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<EFortItemType>                         SubscriptionItemTypesToDisplay;                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpecialCharacterVariantChannelToModify;            // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpecialCharacterActiveVariantTag;                  // 0x0020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> PreviewItems;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BattlePassBase.BattlePassEntrySelectedParams
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FBattlePassEntrySelectedParams final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

