#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePassLandingPages17

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.ExecuteUbergraph_BattlePassLandingPages17
// 0x0140 (0x0140 - 0x0000)
struct BattlePassLandingPages17_C_ExecuteUbergraph_BattlePassLandingPages17 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassLandingPageButtonS17_C*      K2Node_CustomEvent_Button_RewardOverview;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassLandingPageButtonS17_C*      K2Node_CustomEvent_Button_CharacterCustomizer;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassLandingPageButtonS17_C*      K2Node_CustomEvent_Button_MysteryRewards;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassLandingPageButtonS17_C*      K2Node_CustomEvent_Button_BonusRewards;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassLandingPageButtonS17_C*      K2Node_CustomEvent_Button_JoinSubscription;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassS17_LandingPage_SmallButton_C* K2Node_CustomEvent_Button_BuyResources;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassS17_LandingPage_SmallButton_C* K2Node_CustomEvent_Button_GiftBattlePass;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassS17_LandingPage_SmallButton_C* K2Node_CustomEvent_Button_BuyBattlePass;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BPComplete;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassLandingPageButtonS17_C*      K2Node_DynamicCast_AsBattle_Pass_Landing_Page_Button_S17; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassLandingPageButtonS17_C*      K2Node_DynamicCast_AsBattle_Pass_Landing_Page_Button_S17_1; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         K2Node_CustomEvent_Level;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bGiftingAllowed;                      // 0x00C0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSubscriptionAllowed;                 // 0x00C2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassLandingPageButtonS17_C*      K2Node_DynamicCast_AsBattle_Pass_Landing_Page_Button_S17_2; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00D8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00F0(0x0018)()
	bool                                          K2Node_CustomEvent_Is_locked;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0110(0x0018)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_4;                           // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassLandingPageButtonS17_C*      K2Node_DynamicCast_AsBattle_Pass_Landing_Page_Button_S17_3; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Set Quest Page Delay
// 0x0001 (0x0001 - 0x0000)
struct BattlePassLandingPages17_C_Set_Quest_Page_Delay final
{
public:
	bool                                          Is_locked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.OnBattlePassSubscriptionAllowed
// 0x0001 (0x0001 - 0x0000)
struct BattlePassLandingPages17_C_OnBattlePassSubscriptionAllowed final
{
public:
	bool                                          bSubscriptionAllowed;                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.OnBattlePassGiftingAllowed
// 0x0001 (0x0001 - 0x0000)
struct BattlePassLandingPages17_C_OnBattlePassGiftingAllowed final
{
public:
	bool                                          bGiftingAllowed;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.On Level Changed
// 0x0004 (0x0004 - 0x0000)
struct BattlePassLandingPages17_C_On_Level_Changed final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.On BattlePass completed
// 0x0001 (0x0001 - 0x0000)
struct BattlePassLandingPages17_C_On_BattlePass_completed final
{
public:
	bool                                          BPComplete;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_BuyBattlePass_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_BuyBattlePass_Event_0 final
{
public:
	class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyBattlePass_0;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_GiftBattlePass_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_GiftBattlePass_Event_0 final
{
public:
	class UBattlePassS17_LandingPage_SmallButton_C* Button_GiftBattlePass_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_BuyResources_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_BuyResources_Event_0 final
{
public:
	class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyResources_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_JoinSubscription_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_JoinSubscription_Event_0 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_BonusRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_BonusRewards_Event_0 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_MysteryRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_MysteryRewards_Event_0 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_CharacterCustomizer_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_CharacterCustomizer_Event_0 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Button_RewardOverview_Event_2
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Button_RewardOverview_Event_2 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.Play Intro
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_Play_Intro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_0
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_0 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_1
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_1 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_2
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_2 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_3
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_3 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_4
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_4 final
{
public:
	class UBattlePassLandingPageButtonS17_C*      Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_5
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_5 final
{
public:
	class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyResources_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_6
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_6 final
{
public:
	class UBattlePassS17_LandingPage_SmallButton_C* Button_GiftBattlePass_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassLandingPages17.BattlePassLandingPages17_C.SequenceEvent__ENTRYPOINTBattlePassLandingPages17_7
// 0x0008 (0x0008 - 0x0000)
struct BattlePassLandingPages17_C_SequenceEvent__ENTRYPOINTBattlePassLandingPages17_7 final
{
public:
	class UBattlePassS17_LandingPage_SmallButton_C* Button_BuyBattlePass_0;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

