#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BGA_Goop_Deployed

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BGA_Goop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Goop_Deployed.BGA_Goop_Deployed_C
// 0x0078 (0x0C00 - 0x0B88)
class ABGA_Goop_Deployed_C final : public ABGA_Goop_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Goop_Deployed_C;                // 0x0B88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TransitionInLength;                                // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionOutLength;                               // 0x0B94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_VolumeExpirationWarningDuration;               // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MeshZBias;                                         // 0x0BC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle_TrackerGE;                                  // 0x0BC4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UGameplayEffect>            GE_Tracker;                                        // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_GoopTracker;                                   // 0x0BD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_GoopTracker_AddVolume;                    // 0x0BE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_GoopTracker_RemoveVolume;                 // 0x0BE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_Goop_KillVolume;                          // 0x0BF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayParticleEffectAfterFirstSpawn;                // 0x0BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnTime;                                         // 0x0BFC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Goop_Deployed(int32 EntryPoint);
	void Client_Kill_Self_Cleanup();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetExpireWarningAndTransitionOutTimers();
	void PlaySpawnFX();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void AddTracker();
	void KillSelf();
	void ReceiveBeginPlay();
	void EventReceived_159D2F074BDE4709F32BC89676C674FA(const struct FGameplayEventData& Payload);
	void Added_350557D441717B6FB95F66A691D2F0C4();
	void TransitionGoopIn(float TransitionInLength_0);
	void TransitionGoopOut();
	void ActivateVisualsExpireWarning();
	void OnRep_SpawnTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Goop_Deployed_C">();
	}
	static class ABGA_Goop_Deployed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Goop_Deployed_C>();
	}
};

}

