#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Vehicle_Radio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Vehicle_Radio.BP_Vehicle_Radio_C
// 0x0058 (0x0278 - 0x0220)
class ABP_Vehicle_Radio_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMediaSoundComponent*                   RadioSpeaker;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           RadioMediaPlayer;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStreamMediaSource*                 RadioMediaSource;                                  // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         RadioStations;                                     // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         RadioRetryCounter;                                 // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RadioRetries;                                      // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 RadioURL;                                          // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          RadioURLFailure;                                   // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RadioStationIndex;                                 // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Vehicle_Radio(int32 EntryPoint);
	void StopRadio();
	void RadioOpenFailed(const class FString& FailedUrl);
	void RadioURLFailed(const class FString& RetrievedUrl);
	void PlayRadio(const class FString& RetrievedUrl);
	void StartRadio(int32 StationIndex);
	void ReceiveBeginPlay();
	void RadioPlay(const class FString& URL);
	void RadioUnbindEvents(bool JustURL);
	void RadioRetry();
	void RadioClosed();
	void RadioSendAnalytics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vehicle_Radio_C">();
	}
	static class ABP_Vehicle_Radio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Vehicle_Radio_C>();
	}
};

}

