#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BuffetRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum BuffetRuntime.EBuffetFlyingMovementComponentCustomMovementMode
// NumValues: 0x0002
enum class EBuffetFlyingMovementComponentCustomMovementMode : uint8
{
	Flying                                   = 0,
	EBuffetFlyingMovementComponentCustomMovementMode_MAX = 1,
};

// ScriptStruct BuffetRuntime.SimpleSplineOptionalData
// 0x0010 (0x0010 - 0x0000)
struct FSimpleSplineOptionalData final
{
public:
	class UObject*                                OptionalObject;                                    // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OptionalInt;                                       // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BuffetRuntime.BuffetRacePlayerSpeedData
// 0x0010 (0x0010 - 0x0000)
struct FBuffetRacePlayerSpeedData
{
public:
	float                                         SpeedAlongSpline;                                  // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardAcceleration;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularRollSpeed;                                  // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularRollAcceleration;                           // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuffetRuntime.RepBuffetRacePlayerSpeedData
// 0x0004 (0x0014 - 0x0010)
struct FRepBuffetRacePlayerSpeedData final : public FBuffetRacePlayerSpeedData
{
public:
	float                                         Timestamp;                                         // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuffetRuntime.BuffetRacePlayerLocationData
// 0x0010 (0x0010 - 0x0000)
struct FBuffetRacePlayerLocationData
{
public:
	class USplineComponent*                       CurrentSpline;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceDeltaAlongSpline;                          // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularRollDistance;                               // 0x000C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuffetRuntime.RepBuffetRacePlayerLocationData
// 0x0008 (0x0018 - 0x0010)
struct FRepBuffetRacePlayerLocationData final : public FBuffetRacePlayerLocationData
{
public:
	float                                         Timestamp;                                         // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BuffetRuntime.SimpleSplineMovementReplicatedData
// 0x0010 (0x0010 - 0x0000)
struct FSimpleSplineMovementReplicatedData final
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartServerWorldTime;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedTimeAtDeactivate;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuffetRuntime.SimpleSplineCrossedPercentCallbackData
// 0x0030 (0x0030 - 0x0000)
struct FSimpleSplineCrossedPercentCallbackData final
{
public:
	TDelegate<void(const class AActor* Owner, const struct FSimpleSplineOptionalData& OptionalData, const float Percent)> Delegate; // 0x0000(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSimpleSplineOptionalData              OptionalData;                                      // 0x0018(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

