#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BuffetInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function BuffetInfo.BuffetInfo_C.ExecuteUbergraph_BuffetInfo
// 0x0058 (0x0058 - 0x0000)
struct BuffetInfo_C_ExecuteUbergraph_BuffetInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Event_Date;                                 // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Time;                                 // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_AdditionalEvents;                     // 0x0038(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BuffetInfo.BuffetInfo_C.OnRefreshDisplay
// 0x0048 (0x0048 - 0x0000)
struct BuffetInfo_C_OnRefreshDisplay final
{
public:
	class FText                                   Date;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Time;                                              // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   AdditionalEvents;                                  // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

}

