#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BuffetRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BuffetRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BuffetRuntime.BuffetBubblePlayerMovementComponent.SetIsMovingAlongSpline
// 0x0001 (0x0001 - 0x0000)
struct BuffetBubblePlayerMovementComponent_SetIsMovingAlongSpline final
{
public:
	bool                                          bNewIsMovingAlongSpline;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetBubblePlayerMovementComponent.SetSplineComponent
// 0x0010 (0x0010 - 0x0000)
struct BuffetBubblePlayerMovementComponent_SetSplineComponent final
{
public:
	const class USplineComponent*                 InSplineComponent;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance;                                     // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function BuffetRuntime.BuffetBubblePlayerMovementComponent.GetIsMovingAlongSpline
// 0x0001 (0x0001 - 0x0000)
struct BuffetBubblePlayerMovementComponent_GetIsMovingAlongSpline final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.FortSineOscillateComponent.OnRep_CycleTimeOverride
// 0x0004 (0x0004 - 0x0000)
struct FortSineOscillateComponent_OnRep_CycleTimeOverride final
{
public:
	float                                         PreviousCycleTimeOverride;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.FortSineOscillateComponent.OverrideCycleTime
// 0x0008 (0x0008 - 0x0000)
struct FortSineOscillateComponent_OverrideCycleTime final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsMultiplier;                                     // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function BuffetRuntime.FortSineOscillateComponent.OverrideMagnitude
// 0x000C (0x000C - 0x0000)
struct FortSineOscillateComponent_OverrideMagnitude final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsMultiplier;                                     // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         InterpSpeed;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.FortSineOscillateComponent.ResetMagnitude
// 0x0004 (0x0004 - 0x0000)
struct FortSineOscillateComponent_ResetMagnitude final
{
public:
	float                                         InterpSpeed;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetFlyingPawn.BeginMovement
// 0x0008 (0x0008 - 0x0000)
struct BuffetFlyingPawn_BeginMovement final
{
public:
	class AFortPlayerPawnAthena*                  InPlayerPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetFlyingPawn.OnPlayerPawnDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BuffetFlyingPawn_OnPlayerPawnDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetFlyingPawn.GetPlayerPawn
// 0x0008 (0x0008 - 0x0000)
struct BuffetFlyingPawn_GetPlayerPawn final
{
public:
	class AFortPlayerPawnAthena*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.ServerTeleportPlayer
// 0x0008 (0x0008 - 0x0000)
struct BuffetRacePlayerMovementComponent_ServerTeleportPlayer final
{
public:
	float                                         NewDistanceDeltaFromBaseSplineDistance;            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewAngularRollDistance;                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.SetIsMovingAlongSpline
// 0x0001 (0x0001 - 0x0000)
struct BuffetRacePlayerMovementComponent_SetIsMovingAlongSpline final
{
public:
	bool                                          bNewIsMovingAlongSpline;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.SetSplineActor
// 0x0008 (0x0008 - 0x0000)
struct BuffetRacePlayerMovementComponent_SetSplineActor final
{
public:
	class AActor*                                 NewSplineActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.SetTargetSpeeds
// 0x0010 (0x0010 - 0x0000)
struct BuffetRacePlayerMovementComponent_SetTargetSpeeds final
{
public:
	struct FBuffetRacePlayerSpeedData             NewTargetSpeeds;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.GetAngularRollDistance
// 0x0004 (0x0004 - 0x0000)
struct BuffetRacePlayerMovementComponent_GetAngularRollDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.GetCurrentAngularRollSpeed
// 0x0004 (0x0004 - 0x0000)
struct BuffetRacePlayerMovementComponent_GetCurrentAngularRollSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.GetCurrentGroundNormal
// 0x000C (0x000C - 0x0000)
struct BuffetRacePlayerMovementComponent_GetCurrentGroundNormal final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.GetDistanceAlongSpline
// 0x0004 (0x0004 - 0x0000)
struct BuffetRacePlayerMovementComponent_GetDistanceAlongSpline final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.GetIsMovingAlongSpline
// 0x0001 (0x0001 - 0x0000)
struct BuffetRacePlayerMovementComponent_GetIsMovingAlongSpline final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.GetScaledMaxAngularRollDistanceAtSplineDistance
// 0x0008 (0x0008 - 0x0000)
struct BuffetRacePlayerMovementComponent_GetScaledMaxAngularRollDistanceAtSplineDistance final
{
public:
	float                                         SplineDistance;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.BuffetRacePlayerMovementComponent.GetSpline
// 0x0008 (0x0008 - 0x0000)
struct BuffetRacePlayerMovementComponent_GetSpline final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.FortMovementComp_SimpleSpline.RegisterCrossedPercentCallback
// 0x0028 (0x0028 - 0x0000)
struct FortMovementComp_SimpleSpline_RegisterCrossedPercentCallback final
{
public:
	TDelegate<void(const class AActor* Owner, const struct FSimpleSplineOptionalData& OptionalData, const float Percent)> Delegate; // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FSimpleSplineOptionalData              OptionalData;                                      // 0x0010(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Percent;                                           // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function BuffetRuntime.FortMovementComp_SimpleSpline.SetSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct FortMovementComp_SimpleSpline_SetSplineComponent final
{
public:
	const class USplineComponent*                 InSplineComponent;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.FortPlayerAnimInstance_LlamaRider.Boost
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAnimInstance_LlamaRider_Boost final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.FortPlayerAnimInstance_LlamaRider.CheckDirection
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAnimInstance_LlamaRider_CheckDirection final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuffetRuntime.FortSpecialRelevancyAttachComponent.AttachActor
// 0x0010 (0x0010 - 0x0000)
struct FortSpecialRelevancyAttachComponent_AttachActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               LocationRule;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               RotationRule;                                      // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               ScaleRule;                                         // 0x000A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x000B(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function BuffetRuntime.FortSpecialRelevancyAttachComponent.AttachMultiSquadPawns
// 0x0020 (0x0020 - 0x0000)
struct FortSpecialRelevancyAttachComponent_AttachMultiSquadPawns final
{
public:
	TArray<class AFortPlayerPawn*>                OutAttachedPawns;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ControllerGroupIndex;                              // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PawnIndex;                                         // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               LocationRule;                                      // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               RotationRule;                                      // 0x0019(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               ScaleRule;                                         // 0x001A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x001B(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function BuffetRuntime.FortSpecialRelevancyAttachComponent.DetachActor
// 0x0010 (0x0010 - 0x0000)
struct FortSpecialRelevancyAttachComponent_DetachActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               LocationRule;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               RotationRule;                                      // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               ScaleRule;                                         // 0x000A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000B(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function BuffetRuntime.FortSpecialRelevancyAttachComponent.DetachAllActors
// 0x0010 (0x0010 - 0x0000)
struct FortSpecialRelevancyAttachComponent_DetachAllActors final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               LocationRule;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               RotationRule;                                      // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               ScaleRule;                                         // 0x000A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

