#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CraftingRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"
#include "CraftingRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "DataRegistry_structs.hpp"


namespace SDK
{

// Class CraftingRuntime.FortContextualTutorial_CraftingReady
// 0x0000 (0x0120 - 0x0120)
class UFortContextualTutorial_CraftingReady final : public UFortContextualTutorial
{
public:
	void HandleFormulaCraftableChanged(const class FName& FormulaRowName, bool bIsCraftable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_CraftingReady">();
	}
	static class UFortContextualTutorial_CraftingReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingReady>();
	}
};

// Class CraftingRuntime.CraftingCheatManager
// 0x0000 (0x0028 - 0x0028)
class UCraftingCheatManager final : public UChildCheatManager
{
public:
	void StartSelfCrafting(class FName FormulaName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingCheatManager">();
	}
	static class UCraftingCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingCheatManager>();
	}
};

// Class CraftingRuntime.FortContextualTutorial_CraftingTabOpen
// 0x0008 (0x0128 - 0x0120)
class UFortContextualTutorial_CraftingTabOpen final : public UFortContextualTutorial
{
public:
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleFormulaCraftableChanged(const class FName& FormulaRowName, bool bIsCraftable);
	void HandleInventoryTabChanged(const class FName InventoryTabNameId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_CraftingTabOpen">();
	}
	static class UFortContextualTutorial_CraftingTabOpen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingTabOpen>();
	}
};

// Class CraftingRuntime.CraftingLibrary
// 0x0000 (0x0028 - 0x0028)
class UCraftingLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CancelCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject);
	static bool CanCraftFormula(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class FName CraftingFormulaRow, TArray<struct FCraftingIngredientQueryState>* OutIngredientStates);
	static bool CanCraftFormulaWithAdditionalItems(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class FName CraftingFormulaRow, const TArray<struct FItemAndCount>& AdditionalItems, TArray<struct FCraftingIngredientQueryState>* OutIngredientStates);
	static void ClaimCraftingResults(class AFortPlayerController* Instigator, class AActor* CraftingObject);
	static void EjectItems(class AFortPlayerController* Instigator, class AActor* CraftingObject);
	static void GetAllCraftableFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static void GetAllValidIngredients(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<struct FGameplayTagContainer>* OutIngredients);
	static TArray<class UFortWorldItem*> GetCraftedResults_TempItems(class AActor* CraftingObject);
	static bool GetCraftingFormulaIngredientRequirements(class UObject* WorldContextObject, const class FName& CraftingFormulaRow, TArray<struct FCraftingIngredientRequirement>* OutIngredientRequirements);
	static class FName GetCraftingFormulaNameBeingCrafted(class AActor* CraftingObject);
	static TArray<class UFortWorldItem*> GetCraftingIngredients_TempItems(class AActor* CraftingObject);
	static ECraftingObjectState GetCraftingObjectCraftingState(class AActor* CraftingObject);
	static float GetCraftingObjectCurrentCraftingStateEndTime(const class AActor* CraftingObject);
	static float GetCraftingObjectCurrentCraftingStateStartTime(const class AActor* CraftingObject);
	static float GetCraftingObjectCurrentCraftingStateTimeLeft(const class AActor* CraftingObject);
	static void GetCraftingResultsForRowName(const class UObject* WorldContextObject, const class FName& CraftingFormulaRow, TArray<struct FItemAndCount>* OutResults);
	static TArray<class UFortWorldItem*> GetIngredientsInCraftingObject(class AActor* CraftingObject);
	static void GetKnownCraftingFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static void GetUIDataForCraftingIngredientTags(class UObject* WorldContextObject, const struct FGameplayTagContainer& IngredientTags, TArray<TSoftObjectPtr<class UFortItemDefinition>>* OutItemDefs, TArray<TSoftObjectPtr<class UObject>>* OutIcons);
	static void GetValidIngredientsInInventory(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class UFortWorldItem*>* OutIngredients);
	static void GiveItemToCraftingObject(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FFortItemEntry& ItemEntryToGrant);
	static bool IsValidIngredient(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class UFortItemDefinition* ItemDef);
	static void PickupItemAndStartCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, class AFortPickup* PickUp, const class FName& CraftingFormulaName);
	static void ReportCraftingSuccess(class AFortPlayerController* Instigator, class AActor* CraftingObject);
	static void StartCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, const class FName& CraftingFormulaName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingLibrary">();
	}
	static class UCraftingLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingLibrary>();
	}
};

// Class CraftingRuntime.CraftingObjectBGA
// 0x0060 (0x08F8 - 0x0898)
class ACraftingObjectBGA final : public ABuildingGameplayActor
{
public:
	uint8                                         Pad_898[0x8];                                      // 0x0898(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortInventory*                         Inventory;                                         // 0x08A0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A8[0x18];                                     // 0x08A8(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class USphereComponent*                       SphereComponent_InteractionRange;                  // 0x08C0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MenuWidget;                                        // 0x08C8(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                       WidgetComponent_PotContents;                       // 0x08F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleInteractionRangeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void HandleInteractionRangeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingObjectBGA">();
	}
	static class ACraftingObjectBGA* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACraftingObjectBGA>();
	}
};

// Class CraftingRuntime.CraftingObjectComponent
// 0x0448 (0x04F8 - 0x00B0)
class UCraftingObjectComponent : public UGameFrameworkComponent
{
public:
	TMulticastInlineDelegate<void(ECraftingObjectState CraftingState, float CraftingStateStartTime, float CraftingStateDuration)> CraftingObjectStateChanged; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FName& FormulaRowName, bool bIsCraftable)> OnFormulaCraftableChanged; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerController* Instigator, class AActor* CraftingObject, const class FName& FormulaRowName)> OnCraftingSuccess; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FCraftingObjectRepStateData            CraftingObjectRepStateData;                        // 0x00E0(0x0008)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	class FName                                   CraftingFormulaRow;                                // 0x00E8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortPlayerController>   CraftingInstigator;                                // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortItemEntry>                 AllOfTheIngredientItems;                           // 0x00F8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 NonConsumedIngredientItemIndices;                  // 0x0108(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class FString                                 LastIngredientStringForAnalytics;                  // 0x0118(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastFormulaStringForAnalytics;                     // 0x0128(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastResultsStringForAnalytics;                     // 0x0138(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FItemAndCount>                  CraftingResults;                                   // 0x0148(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FGameplayAbilitySpecHandle             WhileCraftingAbilitySpecHandle;                    // 0x0158(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAbilitySpecHandle             OwnerCraftingAbilitySpecHandle;                    // 0x015C(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CraftingObjectTag;                                 // 0x0160(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CraftingTimeLength;                                // 0x0168(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ReadyTimeLength;                                   // 0x0190(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OverCraftingTimeLength;                            // 0x01B8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ResettingTimeLength;                               // 0x01E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   OverCraftingLootTierKey;                           // 0x0208(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bTakeItemsAtCraftingStart : 1;                     // 0x0210(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveIngredientsToCraftingObject : 1;              // 0x0210(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveIngredientsToInstigator : 1;                  // 0x0210(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                IngredientSpawnOffset;                             // 0x0214(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bGiveToCraftingObject : 1;                         // 0x0220(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveResultToInstigator : 1;                       // 0x0220(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftClassPtr<class UClass>                   OwnerCraftingAbility;                              // 0x0228(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CraftingFailedTags;                                // 0x0250(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortPickup*                            PendingPickupCraftingItem;                         // 0x0270(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PendingPickupCraftingFormula;                      // 0x0278(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                         PendingPickupCraftingItemEntry;                    // 0x0280(0x0190)(Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         PendingPickupHeldCount;                            // 0x0410(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_414[0xE4];                                     // 0x0414(0x00E4)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandlePickupCraftingItemPickedUp(class AFortPickup* PickUp, class AFortPawn* InteractingPawn, const class UFortWorldItemDefinition* WorldItemDefinition, const struct FVector& PickupLocation);
	void OnRep_CraftingObjectRepStateData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingObjectComponent">();
	}
	static class UCraftingObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingObjectComponent>();
	}
};

// Class CraftingRuntime.FortContextualTutorial_CraftingComplete
// 0x0000 (0x0120 - 0x0120)
class UFortContextualTutorial_CraftingComplete final : public UFortContextualTutorial
{
public:
	void OnCraftingSuccess(class AFortPlayerController* Instigator, class AActor* CraftingObject, const class FName& FormulaRowName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_CraftingComplete">();
	}
	static class UFortContextualTutorial_CraftingComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingComplete>();
	}
};

// Class CraftingRuntime.FortControllerComponent_CraftingNetworkEvents
// 0x0010 (0x00C0 - 0x00B0)
class UFortControllerComponent_CraftingNetworkEvents final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(class AFortPlayerController* Instigator, class AActor* CraftingObject, const class FName& FormulaRowName)> OnCraftingSuccess; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ClientNotifyCraftingFailed(class AActor* CraftingObject, const struct FGameplayTagContainer& FailedReason);
	void ClientNotifyCraftingSuccess(class AActor* CraftingObject, const class FName& FormulaRowName);
	void NotifyCraftingSuccess(class AActor* CraftingObject, const class FName& FormulaRowName);
	void ServerCancelCrafting(class AActor* CraftingObject);
	void ServerClaimCraftingResults(class AActor* CraftingObject);
	void ServerEjectItems(class AActor* CraftingObject);
	void ServerPickupItemAndStartCrafting(class AActor* CraftingObject, class AFortPickup* PickUp, const class FName& CraftingFormulaName);
	void ServerReportCraftingSuccess(class AActor* CraftingObject);
	void ServerStartCrafting(class AActor* CraftingObject, const class FName& CraftingFormulaName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_CraftingNetworkEvents">();
	}
	static class UFortControllerComponent_CraftingNetworkEvents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CraftingNetworkEvents>();
	}
};

// Class CraftingRuntime.FortGameStateComponent_Crafting
// 0x01B0 (0x0260 - 0x00B0)
class UFortGameStateComponent_Crafting final : public UFortGameStateComponent
{
public:
	struct FDataRegistryType                      CraftingFormulaRegistryType;                       // 0x00B0(0x0008)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      CraftingIngredientsUIDataRegistryType;             // 0x00B8(0x0008)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x140];                                     // 0x00C0(0x0140)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCraftingResult>                CraftingResultsList;                               // 0x0200(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_210[0x50];                                     // 0x0210(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnPlaylistDataReady(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnRep_CraftingResultsList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameStateComponent_Crafting">();
	}
	static class UFortGameStateComponent_Crafting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_Crafting>();
	}
};

// Class CraftingRuntime.FortPickupInteractOverrideComponent_Crafting
// 0x0020 (0x00F0 - 0x00D0)
class UFortPickupInteractOverrideComponent_Crafting : public UFortPickupInteractOverrideComponent
{
public:
	class UFortItemDefinition*                    LastPickupItemDef;                                 // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDefinition*                    LastFocusedItemDef;                                // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   LastTargetFormulaName;                             // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ContextualCraftingInteractDuration;                // 0x00E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETInteractionType                             CachedInteractionType;                             // 0x00EC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionBeingAttempted                    CachedInteractionBeingAttempted;                   // 0x00ED(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_Crafting">();
	}
	static class UFortPickupInteractOverrideComponent_Crafting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_Crafting>();
	}
};

}

