#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DishHitReactSelectionInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DishHitReactSelectionInfo.DishHitReactSelectionInfo
// 0x0014 (0x0014 - 0x0000)
struct FDishHitReactSelectionInfo final
{
public:
	float                                         MinYawToInstigator_7_CD66F5534D2342817E20CB958F42A05E; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxYawToInstigator_9_62A6FC5442FA6451356E01968FB0A85F; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstBlock_25_919B150F474766AEAD087EA3A84DC138;  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   MontageSectionName_17_C1FAF635407E1271A9D38598E5247255; // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

