#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EntityCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum EntityCore.EMovementType
// NumValues: 0x0004
enum class EMovementType : uint8
{
	SweepPhysics                             = 0,
	TeleportPhysics                          = 1,
	ResetPhysics                             = 2,
	EMovementType_MAX                        = 3,
};

// Enum EntityCore.EScriptDiagnosticMessageType
// NumValues: 0x0007
enum class EScriptDiagnosticMessageType : uint8
{
	Debug                                    = 0,
	Verbose                                  = 1,
	Normal                                   = 2,
	Warning                                  = 3,
	Error                                    = 4,
	Fatal                                    = 5,
	EScriptDiagnosticMessageType_MAX         = 6,
};

// ScriptStruct EntityCore.EntityComponentContainer
// 0x0010 (0x0010 - 0x0000)
struct FEntityComponentContainer final
{
public:
	TArray<class UEntityComponent*>               Array;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EntityCore.ComponentData
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FComponentData
{
};
#pragma pack(pop)

// ScriptStruct EntityCore.EntityCoreSystemRelativePositionComponentData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FEntityCoreSystemRelativePositionComponentData final : public FComponentData
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct EntityCore.EntityScaleComponentData
// 0x000C (0x000C - 0x0000)
struct FEntityScaleComponentData final : public FComponentData
{
public:
	struct FVector                                WorldScale3D;                                      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EntityCore.EntityRotationComponentData
// 0x000C (0x000C - 0x0000)
struct FEntityRotationComponentData final : public FComponentData
{
public:
	struct FRotator                               WorldRotation;                                     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EntityCore.EntityPositionComponentData
// 0x000C (0x000C - 0x0000)
struct FEntityPositionComponentData final : public FComponentData
{
public:
	struct FVector                                WorldPosition;                                     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EntityCore.EntityTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FEntityTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct EntityCore.ScriptDiagnosticSourceLocation
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FScriptDiagnosticSourceLocation final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct EntityCore.ScriptDiagnosticMessage
// 0x0058 (0x0058 - 0x0000)
struct FScriptDiagnosticMessage final
{
public:
	EScriptDiagnosticMessageType                  MessageType;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDateTime                              Timestamp;                                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Channel;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   MessageStr;                                        // 0x0020(0x0018)(NativeAccessSpecifierPublic)
	struct FScriptDiagnosticSourceLocation        SourceLocation;                                    // 0x0038(0x0020)(NativeAccessSpecifierPublic)
};

}

