#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_MED_Believer_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Believer_AnimBP.F_MED_Believer_AnimBP_C
// 0x7720 (0x7C30 - 0x0510)
class UF_MED_Believer_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0518(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_40;                       // 0x0620(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_39;                       // 0x0728(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_38;                       // 0x0830(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_37;                       // 0x0938(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_36;                       // 0x0A40(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_35;                       // 0x0B48(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_34;                       // 0x0C50(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_33;                       // 0x0D58(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_32;                       // 0x0E60(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_31;                       // 0x0F68(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_30;                       // 0x1070(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_29;                       // 0x1178(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_28;                       // 0x1280(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_27;                       // 0x1388(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_26;                       // 0x1490(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_25;                       // 0x1598(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_24;                       // 0x16A0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_23;                       // 0x17A8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_22;                       // 0x18B0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_21;                       // 0x19B8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1AC0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1BC8(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1CD0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x2110(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x2550(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2990(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2DD0(0x0440)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_20;                       // 0x3210(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_19;                       // 0x3318(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_18;                       // 0x3420(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x3528(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x3548(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x3568(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x3588(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_17;                       // 0x35A8(0x0108)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x36B0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3750(0x0108)()
	uint8                                         Pad_3858[0x8];                                     // 0x3858(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_4;                         // 0x3860(0x0790)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3FF0(0x0028)()
	uint8                                         Pad_4018[0x8];                                     // 0x4018(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x4020(0x0790)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x47B0(0x0790)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_16;                       // 0x4F40(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_15;                       // 0x5048(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_14;                       // 0x5150(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_13;                       // 0x5258(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_12;                       // 0x5360(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_11;                       // 0x5468(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_10;                       // 0x5570(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x5678(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x5780(0x0790)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x5F10(0x0790)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x66A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x66C8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x66F0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x6848(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x6870(0x0158)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x69C8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x6AD0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x6BD8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x6CE0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x6DE8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x6EF0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x6FF8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x7100(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x7208(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x7310(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x7338(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x7358(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x74B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x74D0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x74F8(0x0158)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x7650(0x0368)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x79B8(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x7B90(0x0030)()
	float                                         __CustomProperty_psd_arm_bk_alpha_r_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_psd_arm_bk_alpha_l_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_psd_arm_fwd_alpha_r_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_psd_arm_fwd_alpha_l_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BCC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_psd_arm_up_alpha_r_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_psd_arm_up_alpha_l_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_knee_rot_r_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_knee_rot_l_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_thigh_rot_r_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_elbow_rot_r_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_elbow_rot_l_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_thigh_rot_l_E297FB62464703EA91C7DCA7329C7AFB; // 0x7BEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         elbow_rot_l;                                       // 0x7BF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         elbow_rot_r;                                       // 0x7BF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_r;                                       // 0x7BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         knee_rot_r;                                        // 0x7BFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         knee_rot_l;                                        // 0x7C00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_l;                                       // 0x7C04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         psd_alpha;                                         // 0x7C08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         psd_arm_up_alpha_l;                                // 0x7C0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         psd_arm_fwd_alpha_l;                               // 0x7C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         psd_arm_bk_alpha_l;                                // 0x7C14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         psd_arm_bk_alpha_r;                                // 0x7C18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         psd_arm_fwd_alpha_r;                               // 0x7C1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         psd_arm_up_alpha_r;                                // 0x7C20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         variantIndex;                                      // 0x7C24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isPistol;                                          // 0x7C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C29[0x3];                                     // 0x7C29(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         pistol_ads_up_alpha_r;                             // 0x7C2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void PSD_Func(const class FString& startJnt, const class FString& driverJnt, const class FString& poseJnt, float Angle, bool debug, float* Alpha);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnCharacterCustomizationLoaded();
	void ExecuteUbergraph_F_MED_Believer_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Believer_AnimBP_C">();
	}
	static class UF_MED_Believer_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Believer_AnimBP_C>();
	}
};

}

