#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Block_GravyGoblin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Block_GravyGoblin.GA_Block_GravyGoblin_C
// 0x0030 (0x0AF8 - 0x0AC8)
class UGA_Block_GravyGoblin_C final : public UFortGameplayAbility_Action
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APrj_GravyGoblin_Holder_C*              TheHolder;                                         // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsUsingGravityGun;                                 // 0x0AD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD9[0x7];                                      // 0x0AD9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AB_GravyGoblin_Athena_C*                Weapon;                                            // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Player;                                            // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Catching;                                          // 0x0AF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Block_GravyGoblin(int32 EntryPoint);
	void K2_ActivateAbility();
	void Removed_0A98CD024061A79D0FA31E8AFBC661C4();
	void Added_35817E954DB467A534E14A9EC6202A63();
	void EventReceived_7CBC3A2449FAA2180916D5BFD94B1673(const struct FGameplayEventData& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Block_GravyGoblin_C">();
	}
	static class UGA_Block_GravyGoblin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Block_GravyGoblin_C>();
	}
};

}

