#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_FlintlockPistol_KnockbackSelf

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_FlintlockPistol_KnockbackSelf.GA_FlintlockPistol_KnockbackSelf_C
// 0x00F0 (0x0B88 - 0x0A98)
class UGA_FlintlockPistol_KnockbackSelf_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_OffsetPitch;                                   // 0x0AA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FinalLaunchVel;                                    // 0x0AC8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD4[0x4];                                      // 0x0AD4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         Row_ResetFall;                                     // 0x0AD8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZVelMult;                                      // 0x0B00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_KnockMag;                                      // 0x0B28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZAdd;                                          // 0x0B50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FX_Delay;                                          // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityForFX;                                     // 0x0B7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           KnockbackCue;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_FlintlockPistol_KnockbackSelf(int32 EntryPoint);
	void CheckVel();
	void K2_ActivateAbility();
	void LaunchPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_FlintlockPistol_KnockbackSelf_C">();
	}
	static class UGA_FlintlockPistol_KnockbackSelf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_FlintlockPistol_KnockbackSelf_C>();
	}
};

}

