#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Goop_VolumeTracker

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Goop_VolumeTracker.GA_Goop_VolumeTracker_C
// 0x00B8 (0x0B50 - 0x0A98)
class UGA_Goop_VolumeTracker_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EventTag_GoopTracker_AddVolume;                    // 0x0AA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_GoopTracker_RemoveVolume;                 // 0x0AA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, float>                    Map_VolumeToTimeSpawned;                           // 0x0AB0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxAllowedGoopVolumesPerInstigator;            // 0x0B00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EventTag_Goop_KillVolume;                          // 0x0B28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_Goop_Tracker;                                  // 0x0B30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Goop_VolumeTracker(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void EventReceived_2AA561A7492A90559685D3A2628FEB4D(const struct FGameplayEventData& Payload);
	void EventReceived_24498C614A306DCCAA29618C55A0F659(const struct FGameplayEventData& Payload);
	void KillExcessGoopVolumes();

	void GoopVolumesExceedLimit(bool* VolumesExceedLimit) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Goop_VolumeTracker_C">();
	}
	static class UGA_Goop_VolumeTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Goop_VolumeTracker_C>();
	}
};

}

