#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Rotate_GravyGoblin

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Rotate_GravyGoblin.GA_Rotate_GravyGoblin_C.ExecuteUbergraph_GA_Rotate_GravyGoblin
// 0x01F0 (0x01F0 - 0x0000)
struct GA_Rotate_GravyGoblin_C_ExecuteUbergraph_GA_Rotate_GravyGoblin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;  // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0030(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00E0(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AB_GravyGoblin_Athena_C*                K2Node_DynamicCast_AsB_Gravy_Goblin_Athena;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x01C0(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APrj_GravyGoblin_Holder_C*              K2Node_DynamicCast_AsPrj_Gravy_Goblin_Holder;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GA_Rotate_GravyGoblin.GA_Rotate_GravyGoblin_C.EventReceived_20AB2D3E4233ABABA0F1A9BC30E1D2B5
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Rotate_GravyGoblin_C_EventReceived_20AB2D3E4233ABABA0F1A9BC30E1D2B5 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function GA_Rotate_GravyGoblin.GA_Rotate_GravyGoblin_C.OnPress_593AE94147F2F333AC498993B68294BE
// 0x0004 (0x0004 - 0x0000)
struct GA_Rotate_GravyGoblin_C_OnPress_593AE94147F2F333AC498993B68294BE final
{
public:
	float                                         TimeWaited;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

