#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GCN_CollisionEffects_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_CollisionEffects_Parent.GCN_CollisionEffects_Parent_C
// 0x0040 (0x01E8 - 0x01A8)
class UGCN_CollisionEffects_Parent_C : public UFortGameplayCueNotify_Burst
{
public:
	class USoundBase*                             SoundAssetDefault;                                 // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAudioComponentParam>           AudioParams;                                       // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInitialActiveSoundParams*              ParamInstance;                                     // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundAssetSmall;                                   // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundAssetMedium;                                  // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundAssetLarge;                                   // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundAssetZeroG;                                   // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBurstGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;
	void GetObjectSizeParam(class AActor* PhysicsObject, int32* Size) const;
	void GetImpactSoundAsset(class AActor* PhysicsObject, class USoundBase** Asset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_CollisionEffects_Parent_C">();
	}
	static class UGCN_CollisionEffects_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGCN_CollisionEffects_Parent_C>();
	}
};

}

