#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GCNL_Athena_ReactorGrade_ChargeUp

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "MotherGameplayRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_ReactorGrade_ChargeUp.GCNL_Athena_ReactorGrade_ChargeUp_C
// 0x0098 (0x08E0 - 0x0848)
class AGCNL_Athena_ReactorGrade_ChargeUp_C final : public AReactorGradeGameplayCue_ChargeUp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0848(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortAudioShapeLineComponent*           FortAudioShapeLine;                                // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxRange;                                          // 0x0858(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPawn*                              Pawn_0;                                            // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UFXSystemComponent*>             LoopingFX;                                         // 0x0888(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FDataTableRowHandle                    Data_Table_Row_Handle;                             // 0x0898(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Min_Charge_Time;                                   // 0x08A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Charge_Time;                                   // 0x08AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Compare_With;                                      // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         Row_TraceThroughBuildingsLimit;                    // 0x08B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCNL_Athena_ReactorGrade_ChargeUp(int32 EntryPoint);
	void OnEndPointFound(const struct FVector& FoundPoint);
	void OnLoopingStartGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void Update_Aim_End_Point_BP(float DeltaTime, struct FVector* End);
	void SetMinMaxChargeTimes();
	void SetEndPoint(const struct FVector& EndPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_ReactorGrade_ChargeUp_C">();
	}
	static class AGCNL_Athena_ReactorGrade_ChargeUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_ReactorGrade_ChargeUp_C>();
	}
};

}

