#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: KnockbackRuntime

#include "Basic.hpp"

#include "KnockbackRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class KnockbackRuntime.FortAthenaMutator_Knockback
// 0x0240 (0x0508 - 0x02C8)
class AFortAthenaMutator_Knockback final : public AFortAthenaMutator
{
public:
	bool                                          bStorePlayerKnockbackData;                         // 0x02C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplicatePlayerKnockbackData;                     // 0x02C9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(const struct FKnockbackMutatorData& KnockbackData)> OnPlayerKnockbackDataChanged; // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FKnockbackMutatorDataArray             AllPlayersKnockbackData;                           // 0x02E0(0x0120)(Net, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bDisplayKnockbackDamageNumbersAsPercentage;        // 0x0400(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ConvertToKnockbackDamageMultiplier;                // 0x0428(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PercentDamageLowMaxThreshold;                      // 0x0450(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PercentDamageMediumMaxThreshold;                   // 0x0478(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         KnockbackMultiplierInitialValue;                   // 0x04A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A4[0x64];                                     // 0x04A4(0x0064)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	TArray<struct FKnockbackMutatorData> GetAllPlayersKnockbackData();
	void HandleBlockedCharacterMovement(struct FHitResult* InOutImpact, class AFortPawn* FortPawn);
	void SetPlayersShouldBreakThroughStructures(const bool bActive, class AFortPlayerPawn* PlayerPawn);

	float GetKnockbackMultiplierInitialValue() const;
	float GetPercentDamageLowMaxThreshold() const;
	float GetPercentDamageMediumMaxThreshold() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Knockback">();
	}
	static class AFortAthenaMutator_Knockback* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Knockback>();
	}
};

// Class KnockbackRuntime.FortGameplayAbility_KnockbackMutator
// 0x0010 (0x0AA8 - 0x0A98)
class UFortGameplayAbility_KnockbackMutator final : public UFortGameplayAbility
{
public:
	class AFortAthenaMutator_Knockback*           CachedMutator;                                     // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortAthenaMutator_Knockback> MutatorClassToGet;                               // 0x0AA0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class AFortAthenaMutator_Knockback* GetCachedMutator();
	void SaveKnockbackData(const struct FKnockbackMutatorData& InKnockbackData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_KnockbackMutator">();
	}
	static class UFortGameplayAbility_KnockbackMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_KnockbackMutator>();
	}
};

}

