#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: M_MED_Winter_Ghoul_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Winter_Ghoul_Skeleton_AnimBlueprint.M_MED_Winter_Ghoul_Skeleton_AnimBlueprint_C
// 0x2960 (0x2E70 - 0x0510)
class M_MED_Winter_Ghoul_Skeleton_AnimBlueprint::UM_MED_Winter_Ghoul_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0548(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0720(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0740(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x0760(0x0790)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0EF0(0x0108)()
	uint8                                         Pad_FF8[0x8];                                      // 0x0FF8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1000(0x0440)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x1440(0x0790)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1BD0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2010(0x0440)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2450(0x0790)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2BE0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2C00(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2D58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2D80(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2DA8(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2E48(0x0020)()

public:
	void ExecuteUbergraph_M_MED_Winter_Ghoul_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_Winter_Ghoul_Skeleton_AnimBlueprint_AnimGraphNode_RigidBody_1145834B4F5912B5533559806A9EB691();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBlueprintGeneratedClass M_MED_Winter_Ghoul_Skeleton_AnimBlueprint.M_MED_Winter_Ghoul_Skeleton_AnimBlueprint_C", true, "M_MED_Winter_Ghoul_Skeleton_AnimBlueprint_C">();
	}
	static class M_MED_Winter_Ghoul_Skeleton_AnimBlueprint::UM_MED_Winter_Ghoul_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<M_MED_Winter_Ghoul_Skeleton_AnimBlueprint::UM_MED_Winter_Ghoul_Skeleton_AnimBlueprint_C>();
	}
};

}

