#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NevadaRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum NevadaRuntime.ETractorBeamState
// NumValues: 0x0004
enum class ETractorBeamState : uint8
{
	TBS_Inactive                             = 0,
	TBS_Charging                             = 1,
	TBS_Active                               = 2,
	TBS_MAX                                  = 3,
};

// Enum NevadaRuntime.ENevadaFlightStates
// NumValues: 0x0009
enum class ENevadaFlightStates : uint8
{
	FLIGHT                                   = 0,
	CRASHING                                 = 1,
	CRASHED                                  = 2,
	REBOOTING                                = 3,
	LANDING                                  = 4,
	LANDED                                   = 5,
	IDLE                                     = 6,
	NONE                                     = 7,
	ENevadaFlightStates_MAX                  = 8,
};

// ScriptStruct NevadaRuntime.NevadaAudioUpdateContext
// 0x0001 (0x0001 - 0x0000)
struct FNevadaAudioUpdateContext final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct NevadaRuntime.NevadaInPersistent
// 0x0100 (0x0248 - 0x0148)
struct FNevadaInPersistent final : public FFortVehicleInPersistent
{
public:
	class UFortNevadaVehicleConfigs*              FortNevadaVehicleConfigs;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostThrust;                                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostDrag;                                        // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         TractorBeamExtraLengthForExtents;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTractorBeamUprightForce;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                CrashingDesiredUp;                                 // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENevadaFlightStates                           CurrentVehicleState;                               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0xDF];                                     // 0x0169(0x00DF)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct NevadaRuntime.NevadaMoveModeConfig
// 0x0014 (0x0014 - 0x0000)
struct FNevadaMoveModeConfig final
{
public:
	float                                         ThrustForce;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LiftForce;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHorizontalSpeed;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVerticalSpeed;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragForceMultiplier;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NevadaRuntime.NevadaState
// 0x0014 (0x0014 - 0x0000)
struct FNevadaState final
{
public:
	ENevadaFlightStates                           CurrentStatus;                                     // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         LivesRemaining;                                    // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHijackingActive;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPilotBubbleCollisionEnabled;                      // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CurrentBatteryCharge;                              // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCannonEnabled;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeamEnabled;                               // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct NevadaRuntime.NevadaOutPersistent
// 0x0338 (0x0348 - 0x0010)
struct FNevadaOutPersistent final : public FFortVehicleOutPersistent
{
public:
	uint8                                         Pad_10[0x338];                                     // 0x0010(0x0338)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct NevadaRuntime.NevadaOutContinuous
// 0x0008 (0x0030 - 0x0028)
struct FNevadaOutContinuous final : public FFortVehicleOutContinuous
{
public:
	float                                         AltimeterTraceHitDistance;                         // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TractorBeamAppliedForceMagnitude;                  // 0x002C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

