#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NevadaUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "NevadaRuntime_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class NevadaUI.FortNevadaVehicleReticle
// 0x00A8 (0x03F0 - 0x0348)
class UFortNevadaVehicleReticle final : public UFortAthenaVehicleDashboardWidget
{
public:
	TSubclassOf<class UNevadaTargetIndicator>     NevadaTargetIndicatorClass;                        // 0x0348(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNevadaTargetIndicator*                 TargetIndicator;                                   // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortNevadaVehicle*                     OwningNevadaVehicle;                               // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_360[0x8];                                      // 0x0360(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUserWidgetPool                        IndicatorPool;                                     // 0x0368(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnBatteryChanged(float BatteryLevel);
	void OnEnergyCannonEnabledChanged(const bool bEnabled);
	void OnEnergyCanonFired(const float Cooldown);
	void OnTractorBeamActivated();
	void OnTractorBeamAttached();
	void OnTractorBeamChargeStarted();
	void OnTractorBeamDeactivated(const float Cooldown);
	void OnTractorBeamDetached();
	void OnTractorBeamEnabledChanged(const bool bEnabled);
	void OnVehicleStateChanged(const ENevadaFlightStates VehicleState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaVehicleReticle">();
	}
	static class UFortNevadaVehicleReticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNevadaVehicleReticle>();
	}
};

// Class NevadaUI.NevadaTargetIndicator
// 0x0010 (0x0310 - 0x0300)
class UNevadaTargetIndicator final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnTargetActorChanged(class AActor* TargetedActor);
	void OnTractorBeamActivated(const bool bActivated);
	void OnTractorBeamAttached(const bool bAttached);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NevadaTargetIndicator">();
	}
	static class UNevadaTargetIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNevadaTargetIndicator>();
	}
};

}

