#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NPC_Pawn_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Struct_NPC_TargetSlots_structs.hpp"
#include "Engine_structs.hpp"
#include "EnemyPawn_Parent_Deimos_classes.hpp"
#include "Enum_NPC_TargetSlots_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Pawn_Parent.NPC_Pawn_Parent_C
// 0x0680 (0x2FE0 - 0x2960)
class ANPC_Pawn_Parent_C : public AEnemyPawn_Parent_Deimos_C
{
public:
	uint8                                         Pad_2954[0x4];                                     // 0x2954(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_Pawn_Parent_C;                  // 0x2958(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundLibraryComponent*                 SoundLibrary_Component;                            // 0x2960(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MovementAudioComponent;                            // 0x2968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPC_VoiceComponent_C*                  NPC_VoiceComponent;                                // 0x2970(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VOAudioComponent;                                  // 0x2978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWidgetComponent*                   NPCStatusWidget;                                   // 0x2980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ScaleMeshInOrOut_MeshScaleAlpha_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x2988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_ScaleMeshInOrOut__Direction_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x298C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_298D[0x3];                                     // 0x298D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline_ScaleMeshInOrOut;                         // 0x2990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_NPC_RecentlyDamaged;                            // 0x2998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevel;                                    // 0x29A0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevelPrevious;                            // 0x29A1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A2[0x6];                                     // 0x29A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<Enum_NPC_AlertLevel, struct FGameplayTag> NPC_AlertLevelToTagMap;                           // 0x29A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NPC_StatusWidgetHealthBarDisabled;                 // 0x29F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F9[0x3];                                     // 0x29F9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           GameplayCue_PickupGrabbed;                         // 0x29FC(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   NPC_BestLootRarityInInventory;                     // 0x2A04(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DebugPawn;                                     // 0x2A05(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NPC_ShowInventoryRarityVisuals;                    // 0x2A06(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A07[0x1];                                     // 0x2A07(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         InventoryGlowDelay;                                // 0x2A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A0C[0x4];                                     // 0x2A0C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         NPC_NumberOfInventoryItemsToDeliverHF;             // 0x2A10(0x0028)(Edit, BlueprintVisible)
	bool                                          NPC_SpawnInvisible;                                // 0x2A38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A39[0x7];                                     // 0x2A39(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  TC_NPC_SpawnAbilityTag;                            // 0x2A40(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  TC_NPC_AlternateSpawnAbilityTag;                   // 0x2A60(0x0020)(Edit, BlueprintVisible)
	bool                                          NPC_IsSpawning;                                    // 0x2A80(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A81[0x3];                                     // 0x2A81(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         NPC_OriginalGravityScale;                          // 0x2A84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NPC_OriginalRotationRate;                          // 0x2A88(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NPC_HasPawnGoal;                                   // 0x2A94(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A95[0x3];                                     // 0x2A95(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 NPC_PawnGoalActor;                                 // 0x2A98(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         NPC_NumberOfInventoryItemsToConsumeBeforeFullHF;   // 0x2AA0(0x0028)(Edit, BlueprintVisible)
	bool                                          NPC_PawnIsDestroyingBuildingForNavigation;         // 0x2AC8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC9[0x7];                                     // 0x2AC9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         MaxIdleVODelay;                                    // 0x2AD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinIdleVODelay;                                    // 0x2AF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NPC_DeathDropLootDelay;                            // 0x2B20(0x0028)(Edit, BlueprintVisible)
	class FName                                   NPC_DeathDropLootTierGroupName;                    // 0x2B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  NPC_DeathDropLootRequiredDamageTags;               // 0x2B50(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  NPC_DeathDropLootForbiddenDamageTags;              // 0x2B70(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  GrantStartingItemsAbilityTC;                       // 0x2B90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NPC_HasItemInInventory;                            // 0x2BB0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB1[0x3];                                     // 0x2BB1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           VoiceTag_FullAlertIdle;                            // 0x2BB4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_Idle;                                     // 0x2BBC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_ReturnToIdle;                             // 0x2BC4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_LostTarget;                               // 0x2BCC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_Suspicious;                               // 0x2BD4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_FullAlert;                                // 0x2BDC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BE4[0x4];                                     // 0x2BE4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FStruct_NPC_TargetSlots>        NPC_TargetSlotsHF;                                 // 0x2BE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NPC_DamageCanCancelIntroPhase;                     // 0x2BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BF9[0x7];                                     // 0x2BF9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagQuery                      TQ_NPC_DamageTagsThatCanCancelIntroPhase;          // 0x2C00(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_NPC_IntroPhaseBehaviorCooldown;                 // 0x2C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_IntroBehaviorActive;                            // 0x2C50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Debug_NPC_AlertLevelForced;                        // 0x2C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C71[0x7];                                     // 0x2C71(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UClass*>                         SoundLibs;                                         // 0x2C78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NPC_PawnCanInteractInternal;                       // 0x2C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C89[0x7];                                     // 0x2C89(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         NPC_PrimtiveDataFloatSetRandomlyInRange;           // 0x2C90(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_PrimtiveDataFloatIndexHF;                      // 0x2CB8(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_PrimtiveDataFloatMinRangeHF;                   // 0x2CE0(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_PrimtiveDataFloatMaxRangeHF;                   // 0x2D08(0x0028)(Edit, BlueprintVisible)
	class AActor*                                 NPC_Leader;                                        // 0x2D30(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GameplayCue_LeaderSet;                             // 0x2D38(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         SoundLibs_Alert;                                   // 0x2D40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         SoundLibs_Aggressive;                              // 0x2D50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         SoundLibs_Foley;                                   // 0x2D60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             UnawareStateChangeSound;                           // 0x2D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AlertStateChangeSound;                             // 0x2D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AggressiveStateChangeSound;                        // 0x2D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NPC_Skeletal_Mesh_Index;                           // 0x2D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8C[0x4];                                     // 0x2D8C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             TamedSound;                                        // 0x2D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        StateChangeSound;                                  // 0x2D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CurrentSoundLIb;                                   // 0x2DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         NPC_ShouldDespawnFromStormHF;                      // 0x2DA8(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DespawnTimerHF;                                // 0x2DD0(0x0028)(Edit, BlueprintVisible)
	struct FGameplayTag                           NPC_DespawnGameplayTag;                            // 0x2DF8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NPC_TestIsInSafeZoneTimer;                         // 0x2E00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NPC_DespawnFromStormTimer;                         // 0x2E08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_isTryingToDespawn;                             // 0x2E10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E11[0x3];                                     // 0x2E11(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           NPC_ResetIntroGameplayTags;                        // 0x2E14(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	float                                         SelectedPrimitiveDataFloat;                        // 0x2E1C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OG_Materials;                                      // 0x2E20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NPC_Apply_GE_for_Swimming;                         // 0x2E30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E31[0x7];                                     // 0x2E31(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 NPC_GE_ClassToApplyForSwimming;                    // 0x2E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Exit_Burst_GC;                                     // 0x2E40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E41[0x3];                                     // 0x2E41(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            NPC_GE_AppliedForSwimming;                         // 0x2E44(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   GoalActorBBKey;                                    // 0x2E4C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GameplayCueLureInterest;                           // 0x2E54(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5C[0x4];                                     // 0x2E5C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                NPC_PreviousLureGoal;                              // 0x2E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Exit_Water;                                        // 0x2E68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Enter_Water;                                       // 0x2E70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         NPC_MaxDistanceFromDamagedNPCToDrawHeallthBarHF;   // 0x2E78(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_HealthBarHideTimeAfterDeathHF;                 // 0x2EA0(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_PlayEffectWhenLuredHF;                         // 0x2EC8(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_PawnCanInteractHF;                             // 0x2EF0(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_AllowInteractOnlyWhenUnawareHF;                // 0x2F18(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_AllowInteractWhenHasLeaderHF;                  // 0x2F40(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_AllowDrownInShallowWaterHF;                    // 0x2F68(0x0028)(Edit, BlueprintVisible)
	bool                                          NPC_IsInventoryInitialized;                        // 0x2F90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isGCForLeaderSetLooping;                           // 0x2F91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F92[0x2];                                     // 0x2F92(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           NPC_DeathByStormTag;                               // 0x2F94(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_TryDespawnAbility;                             // 0x2F9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9D[0x3];                                     // 0x2F9D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            GeOutsideSafeZoneDamageHandle;                     // 0x2FA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGEStormDamageInit;                               // 0x2FA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NPC_MeshScalingInProgress;                         // 0x2FA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FAA[0x2];                                     // 0x2FAA(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                NPC_OriginalMeshScale;                             // 0x2FAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NPCScaleMeshInCompleted;                           // 0x2FB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              NPCScaleMeshOutCompleted;                          // 0x2FC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          NPC_CanDropLoot;                                   // 0x2FD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_NPC_Pawn_Parent(int32 EntryPoint);
	void NPCScaleMeshOut();
	void NPCScaleMeshIn();
	void StopTestingIsInSafeZone();
	void TryWaterInteractionDrown();
	void PlayExitWaterSplash(class AFortWaterBodyActor* Water_Body);
	void PlayEnterWaterSplash(class AFortWaterBodyActor* Water_Body);
	void LuredInterest();
	void LuredOnServer(Enum_NPC_AlertLevel AlertLevel);
	void OnExitedWaterBody(class AFortWaterBodyActor* WaterBody, bool bIsLastBody);
	void OnEnteredWaterBody(class AFortWaterBodyActor* WaterBody, bool bIsFirstBody);
	void OnPawnHealthChanged_Event_0();
	void NPC_AlertLevelChangedServer(Enum_NPC_AlertLevel NPCAlertLevel);
	void StartUpdatingHleathBarWidget();
	void InitializeInventory();
	void AddSoundSystemLibraries();
	void RemoveSoundSystemLibraries();
	void StopUpdatingHealthBarWidget();
	void BeginMusicTracker();
