#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PlayerSurveyMultipleChoiceStandardListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C
// 0x0040 (0x0C60 - 0x0C20)
class UPlayerSurveyMultipleChoiceStandardListItem_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortCheckbox_C*                        CheckBox;                                          // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Choice;                                       // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Number;                                       // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ChoiceIndex;                                       // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortPlayerSurveyQuestionChoice        ChoiceData;                                        // 0x0C48(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem(int32 EntryPoint);
	void OnCurrentTextStyleChanged();
	void SetIndex(int32 Value);
	void SetChoiceData(const struct FFortPlayerSurveyQuestionChoice& Value);
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void UpdateChoiceText();
	void UpdateChoiceIndexText();
	void UpdateCheckBox();
	void UpdateTextStyle();

	void MakeChoiceIndexText(int32 Index_0, class FText* Text) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyMultipleChoiceStandardListItem_C">();
	}
	static class UPlayerSurveyMultipleChoiceStandardListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyMultipleChoiceStandardListItem_C>();
	}
};

}

