#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SkyfireUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function SkyfireUI.SkyfireWidgetBase.HandleOnSecurityPointsChanged_BP
// 0x0004 (0x0004 - 0x0000)
struct SkyfireWidgetBase_HandleOnSecurityPointsChanged_BP final
{
public:
	float                                         SecurityPointValue;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SkyfireUI.SkyfireWidgetBase.OnMutatorAvailable
// 0x0008 (0x0008 - 0x0000)
struct SkyfireWidgetBase_OnMutatorAvailable final
{
public:
	class AFortGameplayMutator*                   MutatorActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SkyfireUI.SkyfireWidgetBase.GetSkyfireMutator
// 0x0008 (0x0008 - 0x0000)
struct SkyfireWidgetBase_GetSkyfireMutator final
{
public:
	class AFortAthenaMutator_Skyfire*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SkyfireUI.SkyfireSquadmateStatusWidget.NativeOnSquadMemberMothershipStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct SkyfireSquadmateStatusWidget_NativeOnSquadMemberMothershipStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           SquadMemberPlayerState;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnMothership;                                   // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function SkyfireUI.SkyfireSquadmateStatusWidget.OnSquadMemberMothershipStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct SkyfireSquadmateStatusWidget_OnSquadMemberMothershipStatusChanged final
{
public:
	bool                                          bIsOnMothership;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

