#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialScreenSection

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialScreenSection.SocialScreenSection_C
// 0x0028 (0x0408 - 0x03E0)
class USocialScreenSection_C final : public UAthenaSocialScreenSection
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutInfo;                                       // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInInfo;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CompletedBox;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialScreenSection(int32 EntryPoint);
	void OnQuestsCompletionStateChanged(const ESlateVisibility CompletionQuestsVisibility);
	void OnSelectedStateUpdated(bool bIsInSelectedState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialScreenSection_C">();
	}
	static class USocialScreenSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialScreenSection_C>();
	}
};

}

