#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialScreenSection

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SocialScreenSection.SocialScreenSection_C.ExecuteUbergraph_SocialScreenSection
// 0x0020 (0x0020 - 0x0000)
struct SocialScreenSection_C_ExecuteUbergraph_SocialScreenSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInSelectedState;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Event_CompletionQuestsVisibility;           // 0x001A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SocialScreenSection.SocialScreenSection_C.OnQuestsCompletionStateChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialScreenSection_C_OnQuestsCompletionStateChanged final
{
public:
	ESlateVisibility                              CompletionQuestsVisibility;                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SocialScreenSection.SocialScreenSection_C.OnSelectedStateUpdated
// 0x0001 (0x0001 - 0x0000)
struct SocialScreenSection_C_OnSelectedStateUpdated final
{
public:
	bool                                          bIsInSelectedState;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

