#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialWhosGoingCard

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialWhosGoingCard.SocialWhosGoingCard_C
// 0x0028 (0x0C50 - 0x0C28)
class USocialWhosGoingCard_C final : public UAthenaSocialWhosGoingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PeekState;                                         // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CardDisplay;                                       // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CardPlaceholder;                             // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OffscreenOverlay;                                  // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialWhosGoingCard(int32 EntryPoint);
	void OnActiveStateChanged(const bool bIsActiveState);
	void OnSetActiveRSVP(bool bRSVPd);
	void OnPeekStateChanged(const bool bIsInPeekState);
	void IsMobileFrontend(bool* bIsMobileFrontend);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialWhosGoingCard_C">();
	}
	static class USocialWhosGoingCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialWhosGoingCard_C>();
	}
};

}

