#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UmamiRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum UmamiRuntime.EFlyingEvasiveManeuversMode
// NumValues: 0x0004
enum class EFlyingEvasiveManeuversMode : uint8
{
	Disabled                                 = 0,
	HorizontalAndVerticalWhileMoving         = 1,
	HorizontalAndVerticalWhileStandingStill  = 2,
	EFlyingEvasiveManeuversMode_MAX          = 3,
};

// Enum UmamiRuntime.EFlyingAttackMovementMode
// NumValues: 0x0004
enum class EFlyingAttackMovementMode : uint8
{
	None                                     = 0,
	ReachTarget                              = 1,
	Evade                                    = 2,
	EFlyingAttackMovementMode_MAX            = 3,
};

// Enum UmamiRuntime.EAITractorBeamMode
// NumValues: 0x0004
enum class EAITractorBeamMode : uint8
{
	None                                     = 0,
	TryToKidnap                              = 1,
	KeepKidnapped                            = 2,
	EAITractorBeamMode_MAX                   = 3,
};

// Enum UmamiRuntime.EKidnapMode
// NumValues: 0x0005
enum class EKidnapMode : uint8
{
	None                                     = 0,
	FromTargetingSystem                      = 1,
	LowPriorityTrackedObject                 = 2,
	HighPriorityTrackedObject                = 3,
	EKidnapMode_MAX                          = 4,
};

// ScriptStruct UmamiRuntime.EvasiveManeuver_Step
// 0x0050 (0x0050 - 0x0000)
struct FEvasiveManeuver_Step final
{
public:
	struct FScalableFloat                         RightMultiplier;                                   // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         UpMultiplier;                                      // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct UmamiRuntime.EvasiveManeuver_Step_Digested
// 0x0008 (0x0008 - 0x0000)
struct FEvasiveManeuver_Step_Digested final
{
public:
	float                                         RightMultiplier;                                   // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpMultiplier;                                      // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UmamiRuntime.HotfixableUmami3DAgentConfiguration
// 0x0078 (0x0078 - 0x0000)
struct FHotfixableUmami3DAgentConfiguration final
{
public:
	struct FScalableFloat                         ProjectionExtentsX;                                // 0x0000(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ProjectionExtentsY;                                // 0x0028(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ProjectionExtentsZ;                                // 0x0050(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
};

// ScriptStruct UmamiRuntime.DestroyBlockerOffsetConfiguration
// 0x0078 (0x0078 - 0x0000)
struct FDestroyBlockerOffsetConfiguration final
{
public:
	struct FScalableFloat                         XOffset;                                           // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         YOffset;                                           // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ZOffset;                                           // 0x0050(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct UmamiRuntime.KidnapCustomTargetWeightConfiguration
// 0x0010 (0x0010 - 0x0000)
struct FKidnapCustomTargetWeightConfiguration final
{
public:
	bool                                          bCheckOnVehicle;                                   // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           TargetTag;                                         // 0x0004(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeightDelta;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UmamiRuntime.UmamiMaximumStuckTimePerBuildingTypeDigested
// 0x000C (0x000C - 0x0000)
struct FUmamiMaximumStuckTimePerBuildingTypeDigested final
{
public:
	struct FGameplayTag                           RequiredTag;                                       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UmamiRuntime.UmamiMaximumStuckTimePerBuildingType
// 0x0030 (0x0030 - 0x0000)
struct FUmamiMaximumStuckTimePerBuildingType final
{
public:
	struct FGameplayTag                           RequiredTag;                                       // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaximumStuckTime;                                  // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct UmamiRuntime.Umami3DNavigationGraphWrapper
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FUmami3DNavigationGraphWrapper final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

