#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ValetMod_Tire_OffRoad_Taxi

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function ValetMod_Tire_OffRoad_Taxi.ValetMod_Tire_OffRoad_Taxi_C.ExecuteUbergraph_ValetMod_Tire_OffRoad_Taxi
// 0x00F0 (0x00F0 - 0x0000)
struct ValetMod_Tire_OffRoad_Taxi_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Taxi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0028(0x00C0)(ContainsInstancedReference)
	class AFortDagwoodVehicle*                    K2Node_Event_ModdedVehicle;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ValetMod_Tire_OffRoad_Taxi.ValetMod_Tire_OffRoad_Taxi_C.OnModAppliedClient
// 0x0008 (0x0008 - 0x0000)
struct ValetMod_Tire_OffRoad_Taxi_C_OnModAppliedClient final
{
public:
	class AFortDagwoodVehicle*                    ModdedVehicle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

