#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Valet_GasPumpIndicatorManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Valet_GasPumpIndicatorManager.Valet_GasPumpIndicatorManager_C
// 0x0040 (0x0260 - 0x0220)
class AValet_GasPumpIndicatorManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UB_GasPump_Valet_Component_C*>   GasPumpList;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSubclassOf<class AActor>                     FuelIndicatorClass;                                // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class AFuelIndicator_C*>               FuelIndicatorList;                                 // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         FuelIndicatorRangeSquared;                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Valet_GasPumpIndicatorManager(int32 EntryPoint);
	void ReceiveBeginPlay();
	void AddGasPump(class UB_GasPump_Valet_Component_C* GasPump);
	void RemoveGasPump(class UB_GasPump_Valet_Component_C* GasPump);
	void PurgeFuelIndicators();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Valet_GasPumpIndicatorManager_C">();
	}
	static class AValet_GasPumpIndicatorManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValet_GasPumpIndicatorManager_C>();
	}
};

}

